{"id": "chunk_0001", "section": "Undergraduate Studies", "page_start": 1, "page_end": 1, "char_count": 458, "text": "Technion Senate The Technion Senate is the authority that determines all academic matters of the institution in accordance with the constitution and bylaws, regulations, academic regulations and academic procedures, including the curricula, degrees, as well\nstudying at the Technion.\ntenured professors within the Senate and is entrusted by the\nUndergraduate Academic Secretary, Ms. Efrat Nativ-Ronen,\nUllman building, 4th floor, which includes the following"}
{"id": "chunk_0002", "section": "activities", "page_start": 1, "page_end": 1, "char_count": 575, "text": "Candidate Assessment Unit headed by Ms. Estee Cohen, Student Unit headed by Ms. Tamar Nissimov, Teaching Unit headed by Ms. Nava Berger, Exam Unit headed by Ms. Limor\nMs. Orit Wakstein, and the Computerized Documentation Unit headed by Mr. Reuben Malka.\nAdmission Tracks, Study Tracks, and Degree\nprograms (graduate studies). This catalogue is specific to\nacademic units. Each unit has either one or several study\nthe unit with which they are affiliated. In addition, the table\nsuccessful completion of the track.\nawarded is called a “Bachelor of Science in…”. There are also"}
{"id": "chunk_0003", "section": "three-year degree programs that earn the title of “Bachelor of", "page_start": 1, "page_end": 1, "char_count": 262, "text": "Science in…”. The medical degree is the exception; it is six years long (after three years, the student will earn a Bachelor of Science in Medical Sciences, and upon completion of the sixth year and an internship, the student will be awarded an M.D.\nthe Technion"}
{"id": "chunk_0004", "section": "information about how to apply for admission to undergraduate", "page_start": 1, "page_end": 1, "char_count": 469, "text": "studies at the Technion are detailed on the Technion’s Admissions website (Ulman Building, 4th floor, phone: 077- 8873306). Below are additional details regarding admission.\nApplicants with no previous academic background\nthose who hold a Bagrut certificate (certificate that indicates that a student has successfully passed Israel’s high school\nscores on the Psychometric University Entrance Test, and if\ntests (for example, the AMIR test or the YAEL test). Additional"}
{"id": "chunk_0005", "section": "admission routes are periodically published on the Registration", "page_start": 1, "page_end": 1, "char_count": 369, "text": "website.\nApplicants who have a different type of matriculation certificate are admitted to the Technion on the basis of technical exams in mathematics, physics, Hebrew, English, and their psychometric exam scores. All applicants to the Faculty of Architecture and Town Planning must also take an entrance exam in landscape architecture. All applicants to the Faculty of"}
{"id": "chunk_0006", "section": "Medicine must also take admission test.", "page_start": 1, "page_end": 1, "char_count": 223, "text": "Applicants with a previous academic background Students who have already studied at the Technion and discontinued their studies on their own accord, or whose studies had been discontinued, will need to be re-admitted to the"}
{"id": "chunk_0007", "section": "Technion on the basis of their initial admission data and on the", "page_start": 1, "page_end": 1, "char_count": 548, "text": "basis of their academic performance at the Technion.\nApplicants who are currently studying, or have previously studied, at another institution of higher education must submit,\nregarding their previous studies, including course syllabi, grades, and all academic evaluations. Decisions regarding the\ncriteria (for more information, see section 3.1.6). Students will\nduring the time in which they were expelled from the Technion,\nIn accordance with the Senate’s decision that was made on May 19, 2013 and June 2, 2013 – the recommendations provided by"}
{"id": "chunk_0008", "section": "the committee for evaluating the curriculum and the study load", "page_start": 2, "page_end": 2, "char_count": 359, "text": "at the Technion were approved; these recommendations focused on various issues including the academic calendar (shortening the semester to 13 weeks, determining the dates of Hannukah vacation, and a shortened exam period); the lack of readiness among students who are accepted to the Technion (completing mandatory courses prior to the start of their studies,"}
{"id": "chunk_0009", "section": "increasing the course completion requirements, refresher", "page_start": 2, "page_end": 2, "char_count": 367, "text": "courses, etc.); foundational studies and courses in the faculties, etc.\nThe Technion began implementing the above recommendations in the 2014-2014 academic year.\nBeginning one’s studies Applicants who have been accepted must begin their studies in the semester for which they have been accepted. Students are accepted to begin in either the winter or spring semester."}
{"id": "chunk_0010", "section": "approval of the Dean of Undergraduate Studies, and approval", "page_start": 2, "page_end": 2, "char_count": 156, "text": "will only be provided in exceptional cases. Applicants who are accepted for the winter semester may start their studies during the previous summer semester."}
{"id": "chunk_0011", "section": "Studies take place across two semesters: the winter semester", "page_start": 2, "page_end": 2, "char_count": 750, "text": "(starts each year in October) and spring semester (starts each year in March). Each semester is 13 weeks, not including holidays and vacations. The summer semester lasts about 7 weeks. In the summer semester, which is an official semester, a limited number of courses are taught; this allows students to close any gaps that they may have in their studies or to progress at a faster pace. Due to the short time span of the semester, the number of weekly teaching hours for each course is double that of a regular semester. It is possible to start one’s studies in any semester (including the summer semester), except for units in\nregular semester. It is possible to start one’s studies in any semester (including the summer semester), except for units"}
{"id": "chunk_0012", "section": "which admission occurs only once a year.", "page_start": 2, "page_end": 2, "char_count": 478, "text": "Semester-long courses The basic unit of study is a semester-long course, i.e., a course that takes place over the course of one semester. Students are expected to complete the course, take an exam in the course and receive a grade. Students who successfully pass a course, will\nwho fail the course will not receive credit for the course.\nPrior to enrolling in a course, students must pass all the\ncourse that is similar to one that they have already taken, will\nwill replace it."}
{"id": "chunk_0013", "section": "Placement exams", "page_start": 2, "page_end": 2, "char_count": 731, "text": "Prior to beginning one’s studies at the Technion, applicants must pass an English placement exam (either via the psychometric test or the AMIR test). Applicants who do not have a Bagrut certificate must pass a Hebrew placement exam. Some applicants must also take a placement exam in Physics and Chemistry.\nEnglish placement exam Taking an English placement exam is mandatory for anyone who has been accepted to the Technion; this requirement can be met either with the “English” portion of the psychometric test or the “AMIR” test. A minimum level of knowledge in English is necessary in order to begin one’s studies at the Technion. The different placement levels are: Advanced English A, Advanced Technical English B, or Exempt."}
{"id": "chunk_0014", "section": "General", "page_start": 2, "page_end": 2, "char_count": 401, "text": "studies at the Technion. The different placement levels are: Advanced English A, Advanced Technical English B, or\nPhysics placement exam The Physics placement exam consists of two parts: mechanics and electricity. Passing the mechanics portion of the exam is a prerequisite for physics-mechanics courses and passing the electricity portion of the exam is a prerequisite for physicselectricity courses."}
{"id": "chunk_0015", "section": "General", "page_start": 2, "page_end": 2, "char_count": 521, "text": "physics-mechanics courses and passing the electricity portion of the exam is a prerequisite for physicselectricity\nExemption from the physics placement exam will be granted in the following circumstances: Students who have been accepted to a program in Architecture, Landscape Architecture, Economics, Education in Science and Technology (in the biology, mathematics, or computer science track), or Medicine;\nstudents who have earned at least 4 units of study in physics on the Bagrut and received a grade of 70 or above."}
{"id": "chunk_0016", "section": "General", "page_start": 2, "page_end": 2, "char_count": 377, "text": "Medicine;\nstudents who have earned at least 4 units of study in physics on the Bagrut and received a grade of 70 or\nExemption from the mechanics portion of the exam will be granted for students who were enrolled in the technological track for practical engineers, specializing in mechanics or agricultural mechanics, and who have received a grade of 70 or above on the external"}
{"id": "chunk_0017", "section": "exams in technical mechanics. Exemption from the electricity", "page_start": 2, "page_end": 2, "char_count": 297, "text": "portion of the exam will be granted to students who were enrolled in the technological track for practical engineers with one of the following specializations: Electronics, Instrumentation, or Evaluation, and who received a passing\nboth parts of the exam will be granted if students earned a grade"}
{"id": "chunk_0018", "section": "of 70 or above in the following courses at the Open University", "page_start": 2, "page_end": 2, "char_count": 435, "text": "Fundamentals of Physics A (20113) and Fundamentals of Physics B (20114) or Fundamentals of Physics (20125).\nExemption from the mechanics portion of the exam will be granted for students who earned a grade of 70 or above in the Open University’s Fundamentals of Physics A (20113) course.\nNote: To receive an exemption from the electricity portion of the exam, passing the Fundamentals of Physics B (20114) course only is not sufficient."}
{"id": "chunk_0019", "section": "Undergraduate Studies | 2021-2022", "page_start": 3, "page_end": 3, "char_count": 456, "text": "Hebrew placement exam For all admitted students who have taken the psychometric test in a language other than Hebrew, or who attended a high school in which the language of instruction was not in Hebrew, must take a Hebrew proficiency test (YAEL test). A minimum level of knowledge in Hebrew is necessary in order to begin one’s studies at the Technion. The different placement levels are:\nHebrew 3 or Exempt with no credit points.\nChemistry placement exam"}
{"id": "chunk_0020", "section": "Students who have been admitted to tracks in Chemical", "page_start": 3, "page_end": 3, "char_count": 359, "text": "Engineering, Biotechnology and Food Engineering, Biology, Environmental Engineering, or Biochemical Engineering, and who have not taken an exam of 3 units in chemistry and received a grade of 70 or above, will need to take the chemistry placement exam. Students who have been admitted to these\nenroll in the chemistry courses taught during the first semester."}
{"id": "chunk_0021", "section": "Information on preparation courses for the placement exams", "page_start": 3, "page_end": 3, "char_count": 755, "text": "and registration for them can be found on the Undergraduate Studies website.\nFaculty members offering private lessons to students at the Technion See page 52.\nAccommodations due to fertility treatments, pregnancy, childbirth, adoption, guardianship, or foster care The Technion recognizes the importance of the principles set forth in the Students’ Rights Act and the rules established by the Council of Education, which increase access to higher education and provide equal opportunities in higher education for students on the basis of fertility treatment, pregnancy, childbirth, adoption, guardianship, or foster care of a child. As\nstudents on the basis of fertility treatment, pregnancy, childbirth, adoption, guardianship, or foster care of a child."}
{"id": "chunk_0022", "section": "such, the Standing Committee of Undergraduate Studies and of", "page_start": 3, "page_end": 3, "char_count": 488, "text": "Graduate Studies has approved, based on the decision made by the academic plenum on August 14, 2012, procedures regarding accommodations due to fertility treatments, pregnancy, childbirth, adoption, guardianship, or foster care. The full text\nAccommodations Due to Fertility, Pregnancy, Childbirth, Adoption, Guardianship, or Foster Care at the end of this\ndifficulties faced by students in these circumstances and to identify the assistance and accommodations to which they are entitled."}
{"id": "chunk_0023", "section": "Each course of study has a defined curriculum consisting of", "page_start": 3, "page_end": 3, "char_count": 256, "text": "courses that include: mandatory courses, faculty electives, and general Technion electives that students can take in any field of their choice. Additionally, the curriculum details the credit\nschedule of course is based on an average rate of progression of"}
{"id": "chunk_0024", "section": "approximately 20 credits per semester. Students can progress at", "page_start": 3, "page_end": 3, "char_count": 976, "text": "a faster or slower pace than the average, in accordance with their personal preferences and circumstances. Prior to each semester, students (preferably with the guidance of an advisor) will choose their own course schedule for the semester and will be responsible for registering for all courses themselves. Once the semester begins, students may still make changes to their course schedule, up until the course change deadline.\nIt is highly recommended that students who are required to enroll in an English language course do so at the start of their studies so that they can best utilize the professional literature in English during their studies. It is also recommended that\nstudies so that they can best utilize the professional literature in English during their studies. It is also recommended\nthis is recommended so that students broaden their horizons. In\nfinal semester – to contact the Undergraduate Academic Secretary of their unit to check whether they will have"}
{"id": "chunk_0025", "section": "completed all degree requirements by the end of the final", "page_start": 3, "page_end": 3, "char_count": 548, "text": "semester.\nStudents who excel in their studies will be awarded the “Dean’s Excellence Award” or the “President’s Excellence Award” and receive a monetary prize. Students who fail will have their circumstances discussed by the academic unit which will consider whether to terminate their studies and then will pass\nthis may or may not lead to a discontinuation of their studies.\nwill receive a recommendation from the unit to have their\ngraduates. Students who have graduated with honors (e.g., magna cum laude) will have this noted on their diploma."}
{"id": "chunk_0026", "section": "Dean of Undergraduate Studies, in consultation with the", "page_start": 4, "page_end": 4, "char_count": 849, "text": "academic units and in accordance with the decisions of the Academic Plenum and the Senate.\n1. Regulations Regarding the Structure of\nTeaching 1.1. Course of Study\nStudies take place during the winter semester, the spring semester and the summer semester. The winter and spring\nsemester lasts approximately 7 weeks and typically includes limited course offerings. At the end each semester, there is an exam period.\nArchitecture and Town Planning for a “Bachelor of\ncourses, mandatory courses, and faculty elective courses (as indicated in Sections 1.1.4-1.1.6 below), as well as the number\nwill be fulfilled through general elective courses at the Technion, as specified in Section 1.1.7 below.\nA.\nOne academic unit can be responsible for several curricula.\na particular concentration, it is defined as a “specialization.”\nis specified in Appendix B."}
{"id": "chunk_0027", "section": "1.1.4 Foundational courses", "page_start": 4, "page_end": 4, "char_count": 464, "text": "Foundational courses include mathematics, physics, chemistry, biology, English, and computer science. The syllabi for the foundational courses are determined by the units responsible for teaching the courses (mathematics, physics, biology, humanities, and computer science).\nThe courses that are offered to all units within the Technion are specified in Appendix C.\nMandatory courses, as well as foundational courses, are determined by the Academic Unit’s Council."}
{"id": "chunk_0028", "section": "1.1.6 Elective courses in the unit", "page_start": 4, "page_end": 4, "char_count": 183, "text": "The list of elective courses that students can enroll in to complete their credit quota are specified in the list or lists prepared by the academic unit. The number of elective course"}
{"id": "chunk_0029", "section": "Each study program will include at least 12 credits (10 credits", "page_start": 4, "page_end": 4, "char_count": 875, "text": "in a three-year program) that are to be fulfilled through general free-choice elective courses that can be taken throughout the departments of the Technion. Of these total credits, at least 6\nand the Faculty of Architecture and Town Planning), and at\ncourses. Students’ enrollment in free-choice elective courses that are offered through the Technion are subject to the rules of\nfor social activities and reserve service will be recognized for\ncourses. Students can fulfill this requirement throughout all their years of study at the Technion, but may not take more than\nphysical education courses due to health reasons that are verified by a doctor’s note will be exempt from this requirement\ndesignated as valid for a particular student if it meets the\nbegan his/her studies or in the catalogue of any academic year\nhas been recommended by the unit and approved by the Dean"}
{"id": "chunk_0030", "section": "1.2.1 Syllabi", "page_start": 5, "page_end": 5, "char_count": 190, "text": "The Unit’s Council will determine the syllabus for each course, which then must be approved by the Senate. Each academic unit will arrange for there to be a teaching committee, which will be"}
{"id": "chunk_0031", "section": "Syllabi for service courses (courses that are provided to another", "page_start": 5, "page_end": 5, "char_count": 1152, "text": "unit) should be created in conjunction with representatives of the receiving unit. The council of the unit providing the service will be responsible for its implementation. Each syllabus will include course objectives, outlined by topic, and will emphasize the principles that will be taught in the course. Each syllabus will be outlined according to chapters in the book or textbook, as well as other supplementary material that will be distributed to students. A copy of the official syllabus will be distributed to each student enrolled in the course. Each academic unit must review and, if necessary, update the curriculum at least once every three years.\nenrolled in the course. Each academic unit must review and, if necessary, update the curriculum at least once every three\ncourse: one lecture hour = 1 credit; one practicum hour = ½ credit; one lab hour = 1/3 credit (except for projects). The credit\nbe increased for increased workloads. However, the number of\nguide. Currently, courses in the Humanities and Arts that include 2 hours of lecture can be worth 1.5 credits. Course\nof the student in practice. In general, 50-60 hours of work per"}
{"id": "chunk_0032", "section": "1.2.3 Connection between courses", "page_start": 5, "page_end": 5, "char_count": 729, "text": "A. Prerequisites\nA prerequisite is a course that must be completed (and passed) prior to enrolling in the course in question. Registration to the course will not be denied if the prerequisite requirement is not fulfilled. However, the instructor will receive a notification and will be able to deny the student enrollment in the course (despite the advisor’s approval). Advisors are asked to carefully consider each approval and limit it to students in good standing only.\nB. Corresponding courses\nThe course in question should not be taken before its corresponding course. All guidelines regarding approval for\ncourses\nThe course in question should not be taken before its corresponding course. All guidelines regarding approval"}
{"id": "chunk_0033", "section": "enrolling in a course for which the prerequisites were not", "page_start": 5, "page_end": 5, "char_count": 208, "text": "fulfilled, also applies in this circumstance.\nC. Courses without additional credit\nCourses that contain a lot of similar material are defined as courses without additional credit. That is, students who enroll"}
{"id": "chunk_0034", "section": "in two such courses will not receive any additional credits.", "page_start": 5, "page_end": 5, "char_count": 186, "text": "Students will not be able to simultaneously enroll in two courses that are specified as courses without additional credit.\nIf a student has successfully passed a specific course and then"}
{"id": "chunk_0035", "section": "enrolls in a course without additional credit, the credits that", "page_start": 5, "page_end": 5, "char_count": 488, "text": "he/she earned in the first course will be revoked and the grade earned in the second course will prevail. If the student passes the course, the number of credits that he/she will earn will be in accordance with the most recent course taken.\nWhen the material taught in the course without additional credit includes all the material from the second course, as well as additional material, the first course will be termed “inclusive” and the second course will be called “included.”\nStudies"}
{"id": "chunk_0036", "section": "1.3.1 Standard level", "page_start": 5, "page_end": 5, "char_count": 353, "text": "Each unit will determine, with the Senate’s approval, the required level to begin taking foundational courses (hereinafter, the standard level). Based on this determination, a\ndetermine whether the specified level is a firm condition for\nlevel can be accepted, so long as they complete the missing\nprogram. We recommend that students who are required to"}
{"id": "chunk_0037", "section": "1.3.2 Placement exams in physics (Mechanics + Electricity)", "page_start": 5, "page_end": 5, "char_count": 257, "text": "Students must pass Part A of the Placement Exam (Mechanics) prior to the start of the third semester of their studies and Part B of the Placement Exam (Electricity) prior to the start of the fourth semester of their studies. In addition, each unit may, with"}
{"id": "chunk_0038", "section": "the approval of the Dean of Undergraduate Studies, set an", "page_start": 5, "page_end": 5, "char_count": 626, "text": "earlier date by which students must pass the two parts of the placement exam in physics. Students who do not fulfill this requirement will be considered to be in “poor academic standing” (see Regulation 3.1.5).\nThe placement exam in physics is mandatory for all students who are admitted to the Technion, except for students admitted to programs in Architecture, Landscape Architecture, Economics, Education in Science and Technology (in the biology, mathematics, or computer science track), or Medicine.\nArchitecture, Economics, Education in Science and Technology (in the biology, mathematics, or computer science track), or"}
{"id": "chunk_0039", "section": "Additional exceptions include", "page_start": 5, "page_end": 5, "char_count": 363, "text": "A. Students who have completed at least 4 units of physics in\nthe matriculation (Bagrut) exam and received a grade of 70 or above.\nB. Exemption from Part A of the Placement Exam (Mechanics)\nwill be provided to students who have completed the technological track for practical engineers, specializing in mechanics or agricultural mechanics, and who have received a"}
{"id": "chunk_0040", "section": "Undergraduate Studies | 2021-2022", "page_start": 6, "page_end": 6, "char_count": 293, "text": "mechanics. Exemption from Part B of the placement exam (Electrical) will be granted to students who completed the technological track for practical engineers with one of the following specializations: Electronics, Instrumentation, or Evaluation, took their exams, and received a score of 70 or"}
{"id": "chunk_0041", "section": "above on their external exams in their primary area of the", "page_start": 6, "page_end": 6, "char_count": 708, "text": "specialization.\nC. Anyone who has studied physics at the university level in\nIsrael or abroad and who received a passing grade, according to what is customary in the relevant institution, will receive full exemption from the physics placement exam.\nD. New immigrants who went to high school abroad will submit\ntheir application for exemption to the Committee for the Examination of Diplomas, which will consult with the Faculty of Physics as necessary. The exemption will be approved as per the recommendations of the committee.\nPassing Part A of the placement exam in Physics or being\nexemption will be approved as per the recommendations of the committee.\nPassing Part A of the placement exam in Physics or"}
{"id": "chunk_0042", "section": "exempt from it is a condition for taking the following courses", "page_start": 6, "page_end": 6, "char_count": 226, "text": "Physics 1 or Physics 1M or Physics 1R or Physics 1P. Passing Part B of the placement exam in Physics or being exempt from it is a condition for taking the following courses: Physics 1 or Physics 1M or Physics 1R or Physics 1P."}
{"id": "chunk_0043", "section": "1.3.3 English studies", "page_start": 6, "page_end": 6, "char_count": 391, "text": "The Placement Exam in English is mandatory for anyone accepted to the Technion. The “English” portion of the psychometric exam or on the “AMIR” test or on the SAT is considered to be a placement exam. A minimum level of knowledge in English is necessary in order to be accepted to the Technion. The different placement levels are: Advanced English A, Advanced Technical English B, or Exempt."}
{"id": "chunk_0044", "section": "General", "page_start": 6, "page_end": 6, "char_count": 884, "text": "accepted to the Technion. The different placement levels are: Advanced English A, Advanced Technical English B, or\nExemption from the Placement Exam in English will be granted to those who have earned a satisfactory grade on the English portion of the psychometric exam, the AMIR test, the SAT exam, or in previous coursework. The “Advanced English A” course and the “Advanced Technical English B” courses are offered through the Department of Humanities and Arts at the Technion. The “Advanced English A” course is a prerequisite for the “Advanced Technical English B” course. The\nArts at the Technion. The “Advanced English A” course is a prerequisite for the “Advanced Technical English B” course.\n(with a grade). Exemption from the English course requirement\nAll students who begin their studies at the Technion starting in the 2021-2022 academic year must take at least 2 English"}
{"id": "chunk_0045", "section": "language courses during their undergraduate studies. This", "page_start": 6, "page_end": 6, "char_count": 492, "text": "requirement can be fulfilled by taking two English language learning courses (Advanced A and B) or two content courses that are taught in the English language, or one English language learning course and one content course that is taught in English.\nThis requirement will be determined in accordance with students’ placement level that is determined at the start of their studies. The content courses that are taught in English will be academic courses that are part of the student’s standard"}
{"id": "chunk_0046", "section": "completed within a maximum of four semesters. A student who", "page_start": 6, "page_end": 6, "char_count": 263, "text": "has not fulfilled this requirement will be considered to be a student in “poor academic standing” [see Section 3.1.5.A (5)].\nStudents who have not completed two of the aforementioned English courses will not be able to complete their studies/receive their degree."}
{"id": "chunk_0047", "section": "1.3.4 Hebrew studies", "page_start": 6, "page_end": 6, "char_count": 770, "text": "All admitted students who did not take the psychometric exam in Hebrew must pass a Hebrew placement exam. A minimum level of knowledge in Hebrew is necessary in order to be accepted into the Technion -113.\nThe different placement levels are: Hebrew 3 or Exempt (which does not grant any credit points). The “Hebrew 3” course will be offered through the Pre-Academic Education Center (preparatory). A passing grade in the “Hebrew 3” course will grant 3 credit points (without a grade; P+). These credits are\n(preparatory). A passing grade in the “Hebrew 3” course will grant 3 credit points (without a grade; P+). These credits\nby the end of their second semester at the Technion will be considered to be a student in “poor academic standing” [see Section 3.1.5.(B) (6)]."}
{"id": "chunk_0048", "section": "1.3.5 Grades in courses that must be completed prior to", "page_start": 6, "page_end": 6, "char_count": 272, "text": "starting one’s studies Courses that must be completed prior to beginning one’s studies do not result in a grade; rather, these courses are pass/fail. These courses are prerequisites for the relevant courses/subjects.\n2. Regulations Relating to the Provision of\nInstruction"}
{"id": "chunk_0049", "section": "2.1.1 Teaching methods", "page_start": 6, "page_end": 6, "char_count": 296, "text": "Instructors will choose which material they will present to students during their lecturers from the syllabus, and can lecture on any other material that they see fit. However, the exams will be based upon the official syllabus, including chapters/sections that the instructor did not lecture on."}
{"id": "chunk_0050", "section": "2.1.2 Guided reading", "page_start": 6, "page_end": 7, "char_count": 519, "text": "If there is no standard form of instruction for a particular subject/course in one of the semesters, and if the nature of the subject lends itself to learning in a guided reading format, students can be instructed in this way after special approval is given by the head of the unit. Guided reading consists of:\nholding regular meetings (at least once a week) with the instructor in charge, as well as submitting assignments as\nrequired. The syllabus will be set in accordance with the points specified in Section 1.2.1."}
{"id": "chunk_0051", "section": "2.1.3 Instructor responsible for the course", "page_start": 7, "page_end": 7, "char_count": 315, "text": "Each course that is offered by more than one instructor, will have one instructor who is appointed by the head of the unit to which the instructors belong to be the instructor responsible for that course. In addition to being responsible for course instruction, this instructor will also be responsible for the exam"}
{"id": "chunk_0052", "section": "2.2.1 Evaluating course performance", "page_start": 7, "page_end": 7, "char_count": 226, "text": "Instructors are responsible for assessing students’ level of learning and the course exam can be used as one of the means to achieve this goal; however, the instructor is not obligated to hold an exam at the end of the course."}
{"id": "chunk_0053", "section": "2.2.2 Standardized evaluation", "page_start": 7, "page_end": 7, "char_count": 305, "text": "To the extent that the course is taught by several different instructors at the same time, the head instructor will be responsible for ensuring that the exam is standardized across instructors, and that the method of evaluation is identical. In addition, the head instructor will be the one to approve the"}
{"id": "chunk_0054", "section": "2.2.3 Exam dates", "page_start": 7, "page_end": 7, "char_count": 372, "text": "At the end of each semester, there will be a period of three weeks during which the first exam dates (Moed A) and then the second exam dates (Moed B) for all courses will be held. During\nfor courses worth fewer than 1.5 credits. In these courses,\nwere held during the course of the semester. There is no option\nnot during the last week of the semester. In courses in which"}
{"id": "chunk_0055", "section": "weight is given to grades provided throughout the semesters and", "page_start": 7, "page_end": 7, "char_count": 450, "text": "tests are held throughout the duration of the semester, it will be possible to hold a test during the last week of the semester, provided that it is held during the standard course time and is similar in scope to the other tests.\nThe Undergraduate Academic Secretary will determine and publish the exam schedule and locations, as well as the seating\nbetween the rooms. Each student will receive an exam card in\nenrolled in that semester is specified."}
{"id": "chunk_0056", "section": "follows: No more than three mid exams can be given in a course", "page_start": 7, "page_end": 7, "char_count": 420, "text": "for which the mid exam replace a final exam, and no more than one valid mid exam can be given in a course for which there is a final exam. Each mid exam shall not exceed two hours and for each valid mid exam that is given, there must be a second date (Moed B) on which students can take the test.\ncourses. Students (besides those in the Faculty of Medicine)\nonly if the head of the unit has recommended this and the Dean"}
{"id": "chunk_0057", "section": "of Undergraduate Studies has approved it. Students who are", "page_start": 7, "page_end": 7, "char_count": 190, "text": "enrolled in a course receive a university grade at the end of the semester that reflects their performance in the course: A grade of 55 or above reflects a passing grade and the student will"}
{"id": "chunk_0058", "section": "receive the allotted number of credits for the course. A grade", "page_start": 7, "page_end": 7, "char_count": 373, "text": "below 55 will reflect a failing grade and the student will not receive any course credit. In both cases, the score will be included in the calculation of the student’s weighted cumulative average. There are a small number of courses in which the grading system is binary --pass/fail. A passing grade entitles\ncumulative average. A student who is registered for a course but"}
{"id": "chunk_0059", "section": "does not fulfill one of the requirements of the course, such as a", "page_start": 7, "page_end": 7, "char_count": 374, "text": "final exam or submission of a project, might not receive a final grade, as per the discretion of the lecturer. Such a course will be counted in the “Course Success Rate” (see Section 3.1.5 below). Eight weeks after the start of the following semester, the student will receive an “incomplete” for that course. For similar projects and courses, in which assignments last more"}
{"id": "chunk_0060", "section": "than one semester, the Dean of Undergraduate Studies may", "page_start": 7, "page_end": 7, "char_count": 183, "text": "delay the recording of the “incomplete” grade until the end of the following semester. Students who are not registered for a course will not be able to receive a grade in that course."}
{"id": "chunk_0061", "section": "2.3.2 Course exemptions", "page_start": 7, "page_end": 8, "char_count": 671, "text": "Students will be able to receive an exemption from courses if they can prove their knowledge in the subject in the following ways: Previous coursework (excluding high school studies) or by way of an exam. Exemption can be granted with credit (P+) or without credit (P-), as per the recommendation of the unit’s\nExemptions will not be granted for courses taken at any institution during the period in which a student was expelled\nscore within 10 days of the exam.\nthe course to the individual responsible for the course’s instruction in the unit, and if there are no reservations, the list\nSecretary. At the same time, the information will be communicated to the students."}
{"id": "chunk_0062", "section": "2.3.3.3 Students who wish to appeal their grade, may do so", "page_start": 8, "page_end": 8, "char_count": 298, "text": "within four days from when a copy of their exam booklet was made available. For the purpose of filing the appeal, students will be entitled to receive a copy of their exam booklet. Students will submit their request for appeal either orally or in writing, as per the instructions of the instructor."}
{"id": "chunk_0063", "section": "2.3.3.4 The course instructor will submit a response to the", "page_start": 8, "page_end": 8, "char_count": 462, "text": "student regarding his/her appeal of the score on the first exam (Moed A), which is to be submitted in the period specified above, no later than one week before the second date of the exam (Moed B). If no response is provided, the student will be entitled to take the exam again (Moed B) on a special date, which will be at least one week after the student receives a response to their appeal, provided that it is before the exam period of the following semester."}
{"id": "chunk_0064", "section": "approved by the Dean of Undergraduate Studies, especially for", "page_start": 8, "page_end": 8, "char_count": 179, "text": "courses in which the period of time between the first and second date of the exam is short. In these cases, an effort shall be made to coordinate with the student representatives."}
{"id": "chunk_0065", "section": "2.4 Reserve Duty", "page_start": 8, "page_end": 8, "char_count": 669, "text": "The Senate recognizes the disruption to students’ studies that results from reserve service and from service within the framework of the academic reserve (hereinafter: reserve duty) during the course of the semester and/or the exam period. The Senate calls on the heads of the academic units and lecturers to alleviate the distress of those serving in the reserves and particularly to those serving for long periods of time during the semester (including the exam period). The academic units must make every effort to allow students to complete the course\nsemester (including the exam period). The academic units must make every effort to allow students to complete the"}
{"id": "chunk_0066", "section": "material and all course requirements in the semester in which", "page_start": 8, "page_end": 8, "char_count": 392, "text": "they are enrolled. The Senate asks all bodies that deal with this matter to do everything in their power so that the disruption is minimized. The purpose of this regulation is to try and minimize the harm to students’ studies among those who are serving in the reserves.\nStudents who serve in the reserves during the semester will be entitled to solutions that will minimize any harm to their"}
{"id": "chunk_0067", "section": "studies, the grades that they deserve or the duration of their", "page_start": 8, "page_end": 8, "char_count": 250, "text": "studies. These solutions, in regard to ensuring that students are able to fulfill course requirements (e.g., tests/exams, labs, practicums), may include a test/exam, practicum, additional work, permission to bring a formula page to the exam, etc., as"}
{"id": "chunk_0068", "section": "specified below", "page_start": 8, "page_end": 8, "char_count": 863, "text": "Absence from an exam Students are entitled to not take an exam during the exam period and to receive an alternative solution, such as taking the exam at a different date, if one of the following conditions are met:\n Reserve service on the day of the exam (except for conferences/interviews in which one can choose the date of participation);\n Reserve service of at least three days per week prior to the exam date;\n Reserve service of at least 10 consecutive days or 14 days in total during the semester, up until the start of the exam period;\n Reserve service of at least 10 days in total during the exam period.\nIf the course instructor sets another date for the exam as a solution, the date of the alternative exam shall be no later than\nthe course instructor sets another date for the exam as a solution, the date of the alternative exam shall be no later"}
{"id": "chunk_0069", "section": "five weeks after the publication of grades of the second exam", "page_start": 8, "page_end": 8, "char_count": 719, "text": "date (Moed B). The faculties are responsible for setting the date of the exam for reservists while taking into account the tests and exam dates of other courses in the current semester.\nThe above instructions also apply to valid tests.\nIn the case of a “protective” exam, the solution offered will be the responsibility of, and at the discretion of, the lecturer, and will be implemented in such a way that does not harm the student.\nInstead of a taking the exam on the alternative date, students will be able to cancel their course registration or can choose to repeat the course at a later time.\nalternative date, students will be able to cancel their course registration or can choose to repeat the course at a later"}
{"id": "chunk_0070", "section": "In the case that the student chooses to repeat the course", "page_start": 8, "page_end": 8, "char_count": 235, "text": " The recorded grade will be “incomplete”.\n The course will not be included in the course success rate calculation.\n The grade will be recorded in the semester in which the\nreceived during the course of the semester in which they had"}
{"id": "chunk_0071", "section": "semester to which they are transferring the grades; the instructor", "page_start": 8, "page_end": 8, "char_count": 239, "text": "shall help the student do so in a way that does not harm the student nor the efforts he/she has invested during the semester in which he/she had reserve duty. The request will be honored by the unit offering the course.\nnot be implemented."}
{"id": "chunk_0072", "section": "Exam appeals", "page_start": 8, "page_end": 8, "char_count": 676, "text": "Students who are not around during the appeal period due to reserve duty, will receive an extension for the date by which the appeal must be filed in accordance with the number of days that they were in reserve duty.\nAssignments Students who are absent due to reserve duty in the two weeks prior to the submission deadline of an assignment will receive an extension for at least the number of days that they were in reserve duty. In the case that the new submission date falls during the exam period, the deadline will be postponed until after the exam period.\ncase that the new submission date falls during the exam period, the deadline will be postponed until after the exam"}
{"id": "chunk_0073", "section": "Undergraduate Studies | 2021-2022", "page_start": 9, "page_end": 9, "char_count": 447, "text": "The extension will also apply to the students’ partners on a group assignment.\nFor students who missed the submission deadline of a significant number of assignments in the course due to reserve duty of 14 days or longer, the instructor will determine an alternative solution for submitting the assignments.\nTime extensions Students will be eligible to receive 25% additional time on the first exam that they take in each course during the current"}
{"id": "chunk_0074", "section": "semester if one of the following conditions is met", "page_start": 9, "page_end": 9, "char_count": 286, "text": "Active reserve duty for a cumulative period of 14 days during the semester, up until the start of the exam period;\nActive reserve duty for a period of 10 days or more in the four weeks prior to the exam period;\nActive reserve duty for 10 consecutive days or more during the exam period."}
{"id": "chunk_0075", "section": "Academic Credits", "page_start": 9, "page_end": 9, "char_count": 307, "text": "Undergraduate students who participated in a recognized social activity for the benefit of the community. without receipt of compensation, in the amount of 26 hours per semester during the course of the year will be eligible to receive one credit towards the general Technion elective credit requirement for"}
{"id": "chunk_0076", "section": "their degree.", "page_start": 9, "page_end": 9, "char_count": 276, "text": "Undergraduate students who participated in a recognized social activity for the benefit of the community, without receipt of compensation, in the amount of 30 hours throughout the year or served in active reserve duty for at least 14 days throughout the\n3. Student Regulations"}
{"id": "chunk_0077", "section": "3.1.1 Counseling", "page_start": 9, "page_end": 9, "char_count": 226, "text": "We recommend that all students utilize academic counseling in their unit to help them to choose a program of study and to assist them with all other academic matters.\nStudents shall enroll for courses for the winter and spring"}
{"id": "chunk_0078", "section": "semesters prior to the start of each semester. For courses that", "page_start": 9, "page_end": 9, "char_count": 621, "text": "are not project-based or laboratory-based, students may make changes to their course list/schedule of classes within the first two weeks of the semester. After the registration and course change period ends (that is, from the start of the semester for project-based and laboratory-based courses and from the start of the 3rd week of the semester for all other courses), changes can only be made in accordance with the guidelines specified in advance by the unit responsible for the course and with the\ncan only be made in accordance with the guidelines specified in advance by the unit responsible for the course and with"}
{"id": "chunk_0079", "section": "approval of the Dean of Undergraduate Studies.", "page_start": 9, "page_end": 9, "char_count": 447, "text": "Starting from the end of the 4th week of the semester, or 3 weeks after the end of the second exam date (Moed B) of the previous semester (whichever comes later), no additional changes can be made except for in exceptional cases and with the approval of\nNew students who do not enroll in any courses in their first semester will not have their place saved at the Technion. In\nwill approve of an extension to the start of studies for such students."}
{"id": "chunk_0080", "section": "3.1.3 Exams and re-enrollment in courses", "page_start": 9, "page_end": 9, "char_count": 254, "text": "A. Students may take the exam on the first date that it is offered\n(Moed A) and/or the second date that it is offered (Moed B).\nB. Students may re-enroll in any course that they have previous\ntaken in order to improve their grade in the course in the two"}
{"id": "chunk_0081", "section": "semesters following the one in which they earned a “passing”", "page_start": 9, "page_end": 9, "char_count": 331, "text": "grade for the first time.\nC. In exceptional circumstances, additional exam dates will be\napproved for the purpose of improving one’s grade, with the recommendation of the academic unit and the approval of the\ngiven to matters related to courses that are offered annually.\nD. Students may re-enroll in any mandatory courses of their"}
{"id": "chunk_0082", "section": "curriculum if the last grade they received in the course was a", "page_start": 9, "page_end": 9, "char_count": 629, "text": "“failing” grade.\nE. Students may enroll in advanced project courses or\nlaboratory-based courses (e.g., a “studio” course in the Faculty of Architecture and Town Planning) up to two times at most.\nThe list of courses to which this provision applies will be\nF. In any case, the last score received is the determining score.\nA. The study tracks will be periodically divided, by the Dean\nthe academic units, into groups that, for the purposes of this section, are called “study routes.” The list of study routes will\nB. The Dean of Undergraduate Studies will determine and\npublish, prior to the President’s Excellence Awards ceremony"}
{"id": "chunk_0083", "section": "held each semester, the numerical thresholds for eligibility for", "page_start": 9, "page_end": 9, "char_count": 240, "text": "the President’s Excellence and Dean’s Excellence Awards for each study route. The thresholds will be determined on the basis of academic performance in the previous semester. The thresholds will be set in such a way such that, in each study"}
{"id": "chunk_0084", "section": "Undergraduate Studies | 2021-2022", "page_start": 10, "page_end": 10, "char_count": 437, "text": "route, there will be approximately 3% of students who will receive the President’s Excellence Award and approximately an additional 15% of students who will receive the Dean’s Excellence Award (including those receiving the President’s Excellence Award) – and under the condition that the threshold does not fall under 91 (President’s Excellence) and 84 (Dean’s Excellence).\nC. The criteria for receiving the President’s Excellence Award"}
{"id": "chunk_0085", "section": "included in the curriculum for the current semester and an", "page_start": 10, "page_end": 10, "char_count": 185, "text": "average grade of 91 or above, provided that this average grade does not fall below the threshold set forth in Section B above.\nThe criteria for the Dean’s Excellence Award are a minimum"}
{"id": "chunk_0086", "section": "of 18 credits earned in courses included in the curriculum for", "page_start": 10, "page_end": 10, "char_count": 216, "text": "the current semester and an average grade of 84 or above, provided that the average grade does not fall below the threshold set forth in Section B above.\nA. Students will be considered to be in poor academic standing"}
{"id": "chunk_0087", "section": "if they meet at least one of the following conditions", "page_start": 10, "page_end": 10, "char_count": 547, "text": "1. A weighted cumulative GPA of less than 65.\n2. A course success rate of less than 66%.\n3. The student was in poor academic standing in the prior\nsemester and did not fulfill the curriculum set forth for him/her.\n4. The student did not fulfill his/her obligation to take the\nPhysics Placement Exam by the required deadline (see Regulation 1.3.2).\n5. The student did not complete his/her English studies\nrequirement by the end of the fourth semester of his/her studies (see Regulation 1.3.3).\n6. The student did not complete his/her Hebrew studies"}
{"id": "chunk_0088", "section": "if they meet at least one of the following conditions", "page_start": 10, "page_end": 10, "char_count": 618, "text": "of the fourth semester of his/her studies (see Regulation 1.3.3).\n6. The student did not complete his/her Hebrew\nrequirement by the end of the second semester of his/her studies (see Regulation 1.3.4).\n7. The student has been studying for the degree for two years\nor more beyond the standard number of years designated for the degree; that is, the student is in his/her 13th semester or beyond\nbeyond (of a three-year degree program), and so on.\n8. The student has accumulated fewer than 27 credits during\ncourse schedule of the study track in which they are enrolled.\n-The English requirement will be recognized as an"}
{"id": "chunk_0089", "section": "recognized as an accumulation of 4 credits. Students who are", "page_start": 10, "page_end": 10, "char_count": 422, "text": "exempt from taking the Technical English course or for whom the course does not appear on the course list for their first year of the study track, will be “debited” 24 credits.\n-This clause does not apply to students who have been\nadmitted to the Technion on the basis of their academic background.\nB. Students’ progress in their degree program will be evaluated\nadvanced years, also at the end of the summer semester, and"}
{"id": "chunk_0090", "section": "after other semesters as required by regulations.", "page_start": 10, "page_end": 10, "char_count": 350, "text": "C. Students who are in poor academic standing will be invited\nto their academic unit for counseling and guidance. The academic unit will hold a discussion and, depending on the severity of the student’s situation, will recommend – to the\nin the program (e.g., specifying a a mandatory course of study/curriculum for one semester or one year, or other"}
{"id": "chunk_0091", "section": "requirements) or will recommend that the student’s studies be", "page_start": 10, "page_end": 10, "char_count": 353, "text": "terminated. During the course of the discussions, the student will have the right to make his/her arguments. In addition, consideration will be given to the opinion of the Student Counseling and Support Center as well as to special circumstances such as reserve duty. The academic unit will inform the student of its recommendation, which will be shared"}
{"id": "chunk_0092", "section": "with the Dean of Undergraduate Studies who will make a", "page_start": 10, "page_end": 10, "char_count": 358, "text": "decision about how to proceed. The academic unit will determine the responsible body for providing counseling and guidance, as well as the procedure for the discussions regarding discontinuing students’ studies, and will be responsible for\nof these decisions. A student whose studies have been terminated will be entitled to appeal the decision in writing or"}
{"id": "chunk_0093", "section": "orally to the Dean of Undergraduate Studies.", "page_start": 10, "page_end": 10, "char_count": 287, "text": "D. Students who were in poor academic standing when their\nstudies were terminated or when they discontinued their studies on their own accord will be able to apply to return to their study program after two years from the date that their studies were discontinued (see Regulation 3.1.6)."}
{"id": "chunk_0094", "section": "3.1.6 Admission for students with a prior academic", "page_start": 10, "page_end": 11, "char_count": 644, "text": "background, and returning to studies after a break Students in good academic standing who discontinue their studies on their own accord will be able to apply to return to their studies at any time. If they have already completed one or\nrecommendation and the approval of the Dean of\nthe unit’s recommendation and with the approval of the Dean\nwhich the grade earned was less than 65, the extent of prior courses that need to be completed, and the duration of studies.\nStudents who return to their studies after a prolonged break (over 3 years) will have a plan determined for them regarding\nThe unit’s recommendation will be sent to the Dean of"}
{"id": "chunk_0095", "section": "Undergraduate Studies for approval, who will be in charge of", "page_start": 11, "page_end": 11, "char_count": 869, "text": "making the final decision.\nStudents who were in poor academic standing when their studies were terminated or when they discontinued their studies on their own accord at the Technion or any other institution, will be able to apply to return to their study program two years from the date at which their studies were discontinued. Students who discontinued their studies on their own accord after only one semester will be able to request a shorter break period, however, this is subject to the approval of the academic unit.\none semester will be able to request a shorter break period, however, this is subject to the approval of the academic\nwho discontinued their studies on their own accord after completing only one semester will be based on the standard\nto be accepted. Requests to return to one’s studies among\nstudies for students who have completed three or more"}
{"id": "chunk_0096", "section": "semesters will be discussed by the academic unit to which the", "page_start": 11, "page_end": 11, "char_count": 299, "text": "student wants to be accepted. The academic unit may require that the student take courses in an external setting during the years in which they are on a break from their studies at the Technion, and may specify an agreement stating that completion of these courses will serve as additional condition"}
{"id": "chunk_0097", "section": "curriculum for the degree, and may add specific requirements", "page_start": 11, "page_end": 11, "char_count": 711, "text": "such as a requirement to repeat courses in which the grade earned was less than 65, the extent of prior courses that need to be completed, and the duration of studies. Students who return to their studies after a prolonged break (over 3 years) will have a plan determined for them regarding courses that need to be\nrecommendation will be sent to the Dean of Undergraduate Studies for approval, who will be in charge of making the final decision.\nanother, in accordance with the following guidelines: Up until the end of the second semester of their studies at the Technion,\nconditional on their academic standing after they have fulfilled\nsubmitted (a GPA of at least 65, a course success rate of at least 66%)."}
{"id": "chunk_0098", "section": "Students who have completed at least two semesters at the", "page_start": 11, "page_end": 11, "char_count": 856, "text": "Technion and have taken courses from the standard course basket (as approved by the Senate on May 23, 1993) and whose performance ranks at the top 25% of the corresponding group of students within the study track to which they wish to transfer, will be admitted to their desired study track.\nApplications from students who have completed at least two\ntop 25%, or who have not taken courses from the relevant course basket, as well as applications from students who have\nin poor academic standing, will be forwarded on to the unit. The unit will submit a recommendation to the Dean of\nof their academic performance at the Technion and their initial\nA. Additional degree\nStudents who are studying at the Technion and who wish to\nenrollment in the integrated study track in the additional unit in which they wish to study. Their application will be considered"}
{"id": "chunk_0099", "section": "only after they have accumulated at least 72 credits.", "page_start": 11, "page_end": 11, "char_count": 175, "text": "The second unit in which the student wishes to study must submit their recommendation to the Dean of Undergraduate Studies for approval, on the basis of the student’s academic"}
{"id": "chunk_0100", "section": "performance, and the unit will determine the curriculum that the", "page_start": 11, "page_end": 11, "char_count": 253, "text": "student will need to complete which will include all mandatory content for the additional track, with the exception of courses that the student has already completed or will complete in the track of his/her “home” faculty. The minimum credit points that"}
{"id": "chunk_0101", "section": "the student must accumulate in both tracks will be 0.75 of the", "page_start": 11, "page_end": 11, "char_count": 177, "text": "total points that must be accumulated in each track.\nFor example, if a student is studying in a track at the Technion in which 160 points must be accumulated, and wants to study"}
{"id": "chunk_0102", "section": "for another degree in a track in which 120 points must be", "page_start": 11, "page_end": 11, "char_count": 236, "text": "accumulated, then in total, he/she must accumulate at least 210 points, and therefore, the remaining credits that the student must complete will consist of at least 50 points.\nThe program of study in the secondary track will be approved"}
{"id": "chunk_0103", "section": "degree if their GPA in the secondary program is 65 or above,", "page_start": 11, "page_end": 12, "char_count": 853, "text": "and only after they complete their studies in their home faculty.\nB. Post-graduate program\nTechnion students and graduates of the Technion or other recognized academic institutions can learn an additional field of study in addition to that in which they earned their first\nStudents will receive an additional certificate, that will constitute an addition to the original diploma. This diploma is\nThe scope of studies in the “Post-Graduate Program” after a 3-\nTechnion, it is possible to earn a certificate within the context\nThis regulation applies to students who studied at another academic institution but did not complete their undergraduate\nfor their previous studies at any academic institution will be\nwas admitted.\nacademic units, into groups which will be called “study routes” for the purposes of this section. The list of study routes will be"}
{"id": "chunk_0104", "section": "thresholds for the academic distinction of summa cum laude", "page_start": 12, "page_end": 12, "char_count": 487, "text": "and cum laude for each study route for the year leading up to the ceremony in the following year. The thresholds for the following year will be determined on the basis of the academic performance of graduates in that study route in the previous semester. The thresholds will be set in such a way that, in each study route, approximately 3% of students will graduate summa cum laude and approximately 15% of students will graduate cum laude (including those who graduate summa cum laude)."}
{"id": "chunk_0105", "section": "The criterion for distinction is the student’s GPA for the list of", "page_start": 12, "page_end": 12, "char_count": 511, "text": "courses for their degree, which must be 91 or above, provided that this GPA is above the threshold set for the summa cum laude distinction in his/her study route. The criterion for honors\nwhich must be 84 or above, provided that this GPA is above the\ncum laude). This is in effect from the 2007-2008 class year,\nthe date on which the last grade was received, and will be set for the first of the month following that date. Confirmation of\nStudies.\nappear in ascending order (by course number), as well as a list"}
{"id": "chunk_0106", "section": "of all courses classified as being beyond the requirements. If a", "page_start": 12, "page_end": 12, "char_count": 300, "text": "student has repeated a course, only the most recent time that the course was taken will appear on the diploma (any courses that were not completed will not appear on the lists, but if the course was taken previously and the student received a grade, that grade is valid and will appear on the lists)."}
{"id": "chunk_0107", "section": "Curriculum", "page_start": 12, "page_end": 12, "char_count": 422, "text": "This procedure refers to the preparation of curricula, which are submitted by the council of the academic units to the Standing Committee for Undergraduate and Graduate Studies, via the\nA. Summary of study program requirements for the degree\n1. The total number of credits, between 155-165 (or between\n2. Mandatory course requirements and a list of mandatory\ncourses (including foundational courses, in accordance with the"}
{"id": "chunk_0108", "section": "requirements of the Senate).", "page_start": 12, "page_end": 12, "char_count": 250, "text": "3. Requirements for elective courses and a list of the elective\ncourses, and the extent of it, as determined by the unit. The total elective course requirements, as per this clause, will not be less\nprogram format as defined by The Council for Higher"}
{"id": "chunk_0109", "section": "programs that award dual or combined degrees, which are not", "page_start": 12, "page_end": 13, "char_count": 652, "text": "in a single-program format as defined by The Council for Higher Education); in addition, there must be a reasonable number of choices from which students can select the elective courses.\n4. Completion of requirements through enrollment in general\nenrichment courses.\nB. Recommended course of study/curriculum\n1. The unit must submit a recommended course of study for 8\n2. The recommended curriculum will apply to students who\nbegin their studies in the winter semester or spring semester\n3. The curriculum must meet the following criteria:\n Completion of fundamental courses within the first 5\ncorresponding requirements, as specified in the syllabus."}
{"id": "chunk_0110", "section": " The number of credits per semester will be between 18-22", "page_start": 13, "page_end": 13, "char_count": 358, "text": "(18-20 in the first semester), and attention should be paid for ensuring that the number of contact hours is reasonable; 30 contact hours is typically the maximum.\n The “Advanced Technical English B” course was included\nC. Syllabi for new courses or changes to a syllabus\nD. Additional guidelines\n1. The curriculum and prerequisites should allow a competent"}
{"id": "chunk_0111", "section": "enrolling in a summer semester; the recommended curriculum", "page_start": 13, "page_end": 13, "char_count": 225, "text": "should be examined through the perspective of the student.\n2. Making changes to foundational courses will be possible\nonce every 3 years, with the exception of turning a mandatory course into an elective course.\nE. Disclaimer"}
{"id": "chunk_0112", "section": "accrual guidelines, as well as the requirements and criteria", "page_start": 13, "page_end": 13, "char_count": 217, "text": "included in detail below. If there are any deviations, the statement must indicate this explicitly and the matter will be brought up for discussion within the Standing Committee for Undergraduate and Graduate Studies."}
{"id": "chunk_0113", "section": " Track – a program of study that leads to a separate degree.", "page_start": 13, "page_end": 13, "char_count": 200, "text": " Specialization – a program of study with a particular concentration for which the student’s participation is recorded only on the transcript.\nWhen an academic unit, with the approval of its council,"}
{"id": "chunk_0114", "section": "proposes to establish a new track that leads to a separate degree,", "page_start": 13, "page_end": 13, "char_count": 440, "text": "a proposal for approval shall be submitted to the Standing Committee through the Academic Development Committee.\nWhen an academic unit decides, through its council, to establish a new specialization within the framework of the study program, it shall be sent to the Standing Committee for approval. Approval for new courses within the same specialization shall be carried out in accordance with the existing procedure for approving courses."}
{"id": "chunk_0115", "section": "Appendix C: Decisions of the Kogan Committee for", "page_start": 13, "page_end": 13, "char_count": 608, "text": "Foundational Studies\n1. Foundational courses will be offered to all academic units at\nthe Technion. There will no course adjustments for academic units due to special arrangements. The topics in the foundational courses will be determined by the units responsible for them (mathematics, physics, chemistry, biology, English, and computer science) in collaboration with committees that will be determined by the Senior Vice President for each of the units. These committees will condense the needs brought up by the units receiving the services, thus assisting in the construction of the foundational courses."}
{"id": "chunk_0116", "section": "Appendix C: Decisions of the Kogan Committee for", "page_start": 13, "page_end": 13, "char_count": 640, "text": "the needs brought up by the units receiving the services, thus assisting in the construction of the foundational\n2. The Faculty of Architecture and Town Planning, the Faculty\nof Medicine, the Faculty of Biology, and the area of Economics and Management in the Faculty of Industrial Engineering and Management will be exceptions. Committees shall be established that will discuss the framework for foundational courses in their units.\n3. There will be a requirement to complete 40 credits of\nBiology),\nSciences courses.\n4. In the Science units (Mathematics, Physics, Chemistry, and\nBiology), it will be mandatory to take courses that total a"}
{"id": "chunk_0117", "section": "minimum of 6 credits from the basket of courses in the Natural", "page_start": 13, "page_end": 14, "char_count": 599, "text": "Sciences, which are not offered by the unit itself.\n5. The choice of courses from the Mathematics and Natural\nSciences baskets will be made by each unit, in accordance with its needs. For example, a unit can choose some of the courses from the baskets of natural sciences and physics, and some of the courses from chemistry or biology.\n6. Within the framework of general studies, special divisions\nwill be organized and each of them will include a number of relevant courses.\n1. Purpose\nthe provision of grades, as is customary at the Technion.\n2. Instructor responsible for the course; standardized"}
{"id": "chunk_0118", "section": "assessment", "page_start": 14, "page_end": 14, "char_count": 451, "text": "For each course that is offered by more than one instructor, the head of the unit offering the course will appoint an instructor who will be responsible for that particular course. In addition to the instructor’s role of being responsible for the course, this instructor will also be responsible for the exam, grades, and\nmethod is identical for all students enrolled in the course. The\nthese instructions. The instructor in charge will be the one who"}
{"id": "chunk_0119", "section": "will approve the grades given by the instructors who teach the", "page_start": 14, "page_end": 14, "char_count": 278, "text": "course and the graders of the exam.\n3. Method of teaching for the course; exams; grade\ncomponents At the start of the course, teachers must specify the teaching\nincluding attendance requirements, exams, assignments, quizzes, tours, etc., as well as the implications arising from"}
{"id": "chunk_0120", "section": "partial fulfillment of course requirements. The details of the", "page_start": 14, "page_end": 14, "char_count": 506, "text": "material that will be taught in the course will be included on the course syllabus, as determined by the course instructor, in addition to the material that will be taught in class. At the start of the course, and at the latest within the first two weeks of the semester, the instructor will determine the components of the final grade, the weight of each component and how each component will be weighed, and will inform the students of this\ncourse, the instructor must inform the students in advance what"}
{"id": "chunk_0121", "section": "type of exams will be included. The instructor of the course", "page_start": 14, "page_end": 14, "char_count": 431, "text": "cannot change the components of the final grade during the semester, except in exceptional circumstances and with the approval of the head of the academic unit. The instructor appointed to be responsible for the course will also be responsible for all that is stated in this section (see point 2 above).\npaid tuition, in accordance with their obligation and subject to tuition regulations, will be permitted to take the exam. Final"}
{"id": "chunk_0122", "section": "exams include a first date of exam (Moed A) and a second date", "page_start": 14, "page_end": 14, "char_count": 214, "text": "of exam (Moed B). Tests given during the course of the semester typically only have one date on which students can take the test.\n4. Exam arrangements; performance evaluations;\nunderstanding of the course material."}
{"id": "chunk_0123", "section": "Undergraduate Studies Secretariat, the instructor", "page_start": 14, "page_end": 14, "char_count": 816, "text": "responsible for the course will prepare the exam. It is advisable for the instructor in charge of the course to consult with the other instructors, who are also proficient in the course material, to ensure that the exam addresses the material specified in the syllabus, that there are no errors in the questions and that they are clearly worded, that the duration of the exam is reasonable and that the exam content matches with the course content. The instructor will be in charge of getting the exam printed and copied, as well as for holding onto it and bringing it to the exam location. If necessary, the instructor will be able to enlist\nas well as for holding onto it and bringing it to the exam location. If necessary, the instructor will be able to\nmake copies of the exam while ensuring its confidentiality."}
{"id": "chunk_0124", "section": "4.3 The relative weight of each question should be specified in", "page_start": 14, "page_end": 14, "char_count": 161, "text": "the exam questionnaire. It is also recommended that the relative weight of each component of the question, if applicable, be specified in the exam questionnaire."}
{"id": "chunk_0125", "section": "4.4 Any exams that include multiple-choice questions", "page_start": 14, "page_end": 14, "char_count": 297, "text": "(“American” style questions) should have at least three exam versions. In other words, there must be at least three exam forms that will have the questions and/or answer choices appear in different orders.\nin the presence of at least two examiners/graders.\n5. Exam dates; exam rooms; exam duration"}
{"id": "chunk_0126", "section": "5.1 The exam schedule will be determined and published for", "page_start": 14, "page_end": 14, "char_count": 642, "text": "the students to see prior to the course registration period.\nAfter the exam schedule is published, it is strictly forbidden to make changes/cancellations/additions. If a need arises to make changes/cancellations/additions due to justifiable reasons, a written process will take place (as opposed to a verbal one) such that the faculty teaching the course will submit an organized request to the Dean of Undergraduate Studies. The instructor will commit to solving any problems that arise as a result of the change. The request\nUndergraduate Studies. The instructor will commit to solving any problems that arise as a result of the change. The"}
{"id": "chunk_0127", "section": "will be approved if the following conditions are met", "page_start": 14, "page_end": 15, "char_count": 607, "text": "1. All students provide their consent in writing.\n2. The change is acceptable to the instructor.\n3. There are available rooms to hold the exam.\n4. The faculty making the request will take care of\nannouncing the change.\nthe Secretary of Undergraduate Studies, after receiving, in\nadvance, the list of exams, including exam durations, dates, and other requirements, from the unit.\nexceed three hours in total. Any deviation from this rule requires the approval of the unit’s undergraduate division\n6. Identification of examinees; instructions for examinees;\ninstructions for exam supervisors; exam supervision"}
{"id": "chunk_0128", "section": "6.1 Examinees must arrive to the exam room at least 10", "page_start": 15, "page_end": 15, "char_count": 269, "text": "minutes prior to the start of the exam with their student ID or their ID card. Students who do not have an ID card can only take the exam after the course instructor identifies them, or if an appropriate arrangement has been made between the student and the instructor."}
{"id": "chunk_0129", "section": "6.2 Students must be seated in specified room that they were", "page_start": 15, "page_end": 15, "char_count": 307, "text": "assigned to take the exam, and not in a room of their choosing. If a list of seating arrangements has been prepared, students must sit only in the seat designated for them and not in another seat of their choosing.\nheads of the units regarding the number of supervisors that are required to be in each room."}
{"id": "chunk_0130", "section": "6.4 Students will act in accordance with the instructions given", "page_start": 15, "page_end": 15, "char_count": 484, "text": "by the exam supervisors while in the exam room. The exam supervisor may, at his/her discretion, move a student to another seat at any time. Upon entering the exam rooms, students will leave their belongings at the entrance (including electronic means of communication which must be turned off). They will only come into the exam room with the material that is permitted for the exam, will sit in the place designated for them by the supervisor and will avoid having any conversations."}
{"id": "chunk_0131", "section": "General", "page_start": 15, "page_end": 15, "char_count": 486, "text": "permitted for the exam, will sit in the place designated for them by the supervisor and will avoid having any\nDuring the entirety of the exam, it is forbidden to have within reach, in the exam room, or next to the exam room any material that is related to the exam itself or the subject of the exam, except for material that has been permitted by the instructor. If a calculator is needed for the exam, only simple scientific calculators that have no means of communication can be used."}
{"id": "chunk_0132", "section": "6.5 A student who enters the exam room and receives the exam", "page_start": 15, "page_end": 15, "char_count": 294, "text": "is considered to have participated in the exam. Students may not leave the exam room during the first hour except for going to the bathroom, as specified in Section 6.7 below. Students will not be allowed to enter the exam room after 30 minutes or more have passed during the start of the exam."}
{"id": "chunk_0133", "section": "6.6 The course instructor, or someone appointed by him/her,", "page_start": 15, "page_end": 15, "char_count": 614, "text": "must be present at the start of the exam and be available throughout the exam to answer students’ questions. In cases in which the exam is supervised by external supervisors, the instructor must arrive to the exam room prior to the start of the exam to guide the supervisors. The role of external supervisors is to oversee the exam only.\nAny deviation from the guidelines for supervisors is conditional on the approval of the Dean of Undergraduate Studies and with prior coordination.\nwill be permitted during the middle third of the exam.\nBathroom breaks will be conducted in an orderly manner by the supervisors."}
{"id": "chunk_0134", "section": "6.8 In very exceptional circumstances, the instructor in charge,", "page_start": 15, "page_end": 15, "char_count": 172, "text": "or someone on his/her behalf, may decide to provide extra time on the exam for all students. Extra time for certain students will be given on the basis of approval from the"}
{"id": "chunk_0135", "section": "Dean of Undergraduate Studies only; the instructor must", "page_start": 15, "page_end": 15, "char_count": 259, "text": "respect this approval. The student must bring with him/her the time extension approval and present it to the supervisors at the exam. All students eligible for time extensions will sit in a separate room (if possible) that will be devoted for time extensions."}
{"id": "chunk_0136", "section": "6.9 If additional supervisors are needed (in addition to the", "page_start": 15, "page_end": 15, "char_count": 609, "text": "external supervisors and the course instructors and their assistants), the head of the unit will utilize the list of assistants and instructors in the unit and divide the supervision load among them. Adjunct instructors will only\ninstructors in the unit and all the assistants and facilitators\nthere are no external supervisors, the supervisors will receive a copy of the “Instructions for Exam Supervisors”\nwill fulfill their role accordingly. Any unusual event during the exam will be reported on the supervision form.\n7. Grading exams; publishing grades\nat the exam dates stipulated in Section 2.2.3 of the"}
{"id": "chunk_0137", "section": "Undergraduate Studies Regulations and Procedures will be", "page_start": 15, "page_end": 16, "char_count": 640, "text": "graded without seeing the name of the examinee on the exam notebook. The instructor in charge of the course can be assisted by assistant instructors, but the final grade must be provided by him/her only. If there is no option to do so logistically, then it will be done by another senior instructor, as determined by the head of the unit. It is recommended that teaching assistants and undergraduate\nresponsible for submitting the list of students’ scores in the\nacademic unit responsible for teaching the course, and if\nhe/she has no reservations, the grades will be sent for publication. The course instructor is responsible for\nthe exam."}
{"id": "chunk_0138", "section": "7.3 Students may take the exam on the first date that it is", "page_start": 16, "page_end": 16, "char_count": 414, "text": "offered (Moed A) and/or the second date that it is offered (Moed B). It is recommended that students take the exam on the first date. Students are not allowed to take three\ncases in which a student takes more than one exam in a given course, the last grade that they received will be the final grade.\ntheir exam notebook within a reasonable amount of time\n8. Grade appeals\nof their exam notebook becomes available."}
{"id": "chunk_0139", "section": "8.2 The appeal must be submitted in writing on a form that can", "page_start": 16, "page_end": 16, "char_count": 432, "text": "be obtained from the unit. The student must specify his/her reasons for filing the appeal on the form. The student filing International Program Students at the the appeal will be made aware that the entire exam may be re-graded, and not just the sections that he/she specified in the appeal. Thus, the appeal may result in no change to the grade, a higher score or a lower score. There is no right to appeal a grade on an oral exam."}
{"id": "chunk_0140", "section": "8.3 The course instructor must respond to appeals within a", "page_start": 16, "page_end": 16, "char_count": 447, "text": "reasonable amount of time (no later than one week before the second exam date). An instructor who wishes to change a grade, must submit a reasoned request to be approved by\nlong after the publication of the grade, must be reasoned and detailed and must receive approval from the\nrequests will be brought for approval by the Dean of\n9. Holding on to exam notebooks\ninstructor for one year. After this period of time, the notebooks can be destroyed."}
{"id": "chunk_0141", "section": "Specializations at the Technion", "page_start": 17, "page_end": 17, "char_count": 247, "text": "Secondary Specialization in Entrepreneurial Leadership A new program designed for students across all faculties at the Technion.\nThe secondary specialization in entrepreneurial leadership will\n1.\tFaculty courses on entrepreneurship in the field of"}
{"id": "chunk_0142", "section": "knowledge of the faculty – mandatory (2 credits).", "page_start": 17, "page_end": 17, "char_count": 155, "text": "2.\tEntrepreneurial leadership course in the Department\nof Humanities in collaboration with the Center for Entrepreneurship and Innovation at the Technion –"}
{"id": "chunk_0143", "section": "mandatory (2 credits).", "page_start": 17, "page_end": 17, "char_count": 1029, "text": "3.\tCluster of elective courses (6 credits, choice of 3\ncourses from a total of 10 courses that are offered) in the Department of Humanities in collaboration with the Center for Entrepreneurship and Innovation at the Technion.\nThe specialization is intended for undergraduate students of the Technion. As part of the specialization, students will take courses on a variety of topics covering the theory, practical experience, and application of ‘entrepreneurial leadership’.\nUndergraduate students at the Technion who meet the\n1.\tSuccessfully completed courses totaling at least 36\n2. Cumulative GPA above 75.\nEach student’s application must be submitted to the\nAs part of the specialization, students must complete at least\nA. Completing the degree requirements of the primary\nB. Completion of the mandatory courses:\n1. Entrepreneurial Leadership – 2 credits\n2.\tTechnological/Scientific Leadership in the faculty\nC. At least 3 elective courses from the ‘Entrepreneurial\nLeadership’ basket of courses. These courses are recognized"}
{"id": "chunk_0144", "section": "as courses of The Council for Higher Education", "page_start": 17, "page_end": 17, "char_count": 572, "text": "1. Fundamentals of Entrepreneurship – 2 credits\n2.\tManagement of Entrepreneurial Projects – 2 credits\n3. Leadership and Social Entrepreneurship – 2 credits\n4. Business Entrepreneurship – 2 credits\n5. Harnessing the Business Ecosystem – 2 credits\n6. Entrepreneurial Leadership in Organizations –\n7. Legal Aspects of Business Entrepreneurship – 2\n8. Marketing for Entrepreneurs – 2 credits\n9.\tHigh-Tech in Israel – A Strategy for Preserving\n10. Usability of Software Interfaces – 2 credits\n11. Design Thinking – 2 credits\n12. Creativity, Innovation and Happiness – 2 credits"}
