{
  "doc-a6d4c582d3666908b702dc3740d65d66": {
    "content": "=== Page 1 ===\nUndergraduate Studies | 2021-2022\nUndergraduate Studies\nTechnion Senate\nThe Technion Senate is the authority that determines all\nacademic matters of the institution in accordance with the\nconstitution and bylaws, regulations, academic regulations and\nacademic procedures, including the curricula, degrees, as well\nas the regulations and procedures related to teaching and\nstudying at the Technion. Undergraduate Studies\nThe Dean of Undergraduate studies is elected by the full-time\ntenured professors within the Senate and is entrusted by the\nSenate to oversee undergraduate studies at the Technion."
  },
  "doc-1cb23444a93fa30e1d4b26c869746ad8": {
    "content": "tenured professors within the Senate and is entrusted by the\nSenate to oversee undergraduate studies at the Technion. The\nUndergraduate Academic Secretary, Ms. Efrat Nativ-Ronen,\nmanages the Undergraduate Studies Center located in the\nUllman building, 4th floor, which includes the following\nactivities:\nCandidate Assessment Unit headed by Ms. Estee Cohen,\nStudent Unit headed by Ms. Tamar Nissimov, Teaching Unit\nheaded by Ms. Nava Berger, Exam Unit headed by Ms. Limor\nArzuan, Process Evaluation and Information Unit headed by\nMs."
  },
  "doc-368c4b0b25737a4061f9f0ac1b55198b": {
    "content": "headed by Ms. Nava Berger, Exam Unit headed by Ms. Limor\nArzuan, Process Evaluation and Information Unit headed by\nMs. Orit Wakstein, and the Computerized Documentation Unit\nheaded by Mr. Reuben Malka. Admission Tracks, Study Tracks, and Degree\nTracks\nThe Technion offers bachelor’s degree programs\n(undergraduate studies) as well as master’s and doctoral degree\nprograms (graduate studies). This catalogue is specific to\nundergraduate studies and graduate studies. Students who apply\nand are accepted to a bachelor’s degree program in one of the\nadmission tracks are thus considered to belong to one of the\nacademic units."
  },
  "doc-c279fb4e293f0ce347c22f821f36e001": {
    "content": "a bachelor’s degree program in one of the\nadmission tracks are thus considered to belong to one of the\nacademic units. Each unit has either one or several study\ntracks per degree. The table presents all admission tracks and\nthe unit with which they are affiliated. In addition, the table\npresents all possible study tracks, along with the years of study\nand the name of the degree that students will receive upon\nsuccessful completion of the track. Most of the study tracks are four years long, and the degree\nawarded is called a “Bachelor of Science in…”."
  },
  "doc-239e711a65022776eaf4ce0abe56e106": {
    "content": "the track. Most of the study tracks are four years long, and the degree\nawarded is called a “Bachelor of Science in…”. There are also\nthree-year degree programs that earn the title of “Bachelor of\nScience in…”. The medical degree is the exception; it is six\nyears long (after three years, the student will earn a Bachelor of\nScience in Medical Sciences, and upon completion of the sixth\nyear and an internship, the student will be awarded an M.D. degree. Bachelor’s Degree Admission Requirements at\nthe Technion\nThe Dean of Undergraduate Studies is responsible for accepting\ncandidates to the Technion."
  },
  "doc-701ca2d26239a543aeb743513572f320": {
    "content": "Requirements at\nthe Technion\nThe Dean of Undergraduate Studies is responsible for accepting\ncandidates to the Technion. Admission requirements and\ninformation about how to apply for admission to undergraduate\nstudies at the Technion are detailed on the Technion’s\nAdmissions website (Ulman Building, 4th floor, phone: 077-\n8873306). Below are additional details regarding admission."
  },
  "doc-e8f0ce997ccd9decaa18ebb15735304a": {
    "content": "Admissions website (Ulman Building, 4th floor, phone: 077-\n8873306). Below are additional details regarding admission. Applicants with no previous academic background\nAdmission to undergraduate studies at the Technion among\nthose who hold a Bagrut certificate (certificate that indicates\nthat a student has successfully passed Israel’s high school\nmatriculation exam) will be based on students’ Bagrut grades,\nscores on the Psychometric University Entrance Test, and if\nnecessary, also on entrance exams and language proficiency\ntests (for example, the AMIR test or the YAEL test)."
  },
  "doc-3a21d88efbb77db38c8bcd4e30f5d08c": {
    "content": "and if\nnecessary, also on entrance exams and language proficiency\ntests (for example, the AMIR test or the YAEL test). Additional\nadmission routes are periodically published on the Registration\nwebsite. Applicants who have a different type of matriculation\ncertificate are admitted to the Technion on the basis of technical\nexams in mathematics, physics, Hebrew, English, and their\npsychometric exam scores. All applicants to the Faculty of\nArchitecture and Town Planning must also take an entrance\nexam in landscape architecture."
  },
  "doc-90334739a6dbb1f6c52a035365702887": {
    "content": "applicants to the Faculty of\nArchitecture and Town Planning must also take an entrance\nexam in landscape architecture. All applicants to the Faculty of\nMedicine must also take admission test. Applicants with a previous academic background\nStudents who have already studied at the Technion and\ndiscontinued their studies on their own accord, or whose studies\nhad been discontinued, will need to be re-admitted to the\nTechnion on the basis of their initial admission data and on the\nbasis of their academic performance at the Technion."
  },
  "doc-1ff435bdad62d701f3a693448f9d20a2": {
    "content": "Technion on the basis of their initial admission data and on the\nbasis of their academic performance at the Technion. Applicants who are currently studying, or have previously\nstudied, at another institution of higher education must submit,\nto the Candidate Assessment Unit, comprehensive information\nregarding their previous studies, including course syllabi,\ngrades, and all academic evaluations. Decisions regarding the\nadmission of applicants will be made on the basis of their past\nacademic performance and on the basis of the initial admissions\ncriteria (for more information, see section 3.1.6)."
  },
  "doc-25f281948278aeb7ec1a8ea8d843e387": {
    "content": "academic performance and on the basis of the initial admissions\ncriteria (for more information, see section 3.1.6). Students will\nnot receive any credits (grades or exemptions) for courses taken\nduring the time in which they were expelled from the Technion,\nas per the student disciplinary regulations."
  },
  "doc-71bbb4fc1704f0706ca18684cf245d8b": {
    "content": "taken\nduring the time in which they were expelled from the Technion,\nas per the student disciplinary regulations. Course of Study\nThe following is an overview of the course of study for a\nbachelor’s degree:\nIn accordance with the Senate’s decision that was made on May\n19, 2013 and June 2, 2013 – the recommendations provided by\n\n=== Page 2 ===\nUndergraduate Studies | 2021-2022\nthe committee for evaluating the curriculum and the study load\nat the Technion were approved; these recommendations\nfocused on various issues including the academic calendar\n(shortening the semester to 13 weeks, determining the dates of\nHannukah vacation, and a shortened exam period); the lack of\nreadiness among students who are accepted to the Technion\n(completing mandatory courses prior to the start of their studies,\nincreasing the course completion requirements, refresher\ncourses, etc.); foundational studies and courses in the faculties,\netc."
  },
  "doc-d95166f3219f138e291bb389e790259c": {
    "content": "the course completion requirements, refresher\ncourses, etc.); foundational studies and courses in the faculties,\netc. The Technion began implementing the above recommendations\nin the 2014-2014 academic year. Beginning one’s studies\nApplicants who have been accepted must begin their studies in\nthe semester for which they have been accepted. Students are\naccepted to begin in either the winter or spring semester. Deferring admission for one semester is only possible with the\napproval of the Dean of Undergraduate Studies, and approval\nwill only be provided in exceptional cases."
  },
  "doc-074cb1d65b5606c16025a3ab4bc58b54": {
    "content": "with the\napproval of the Dean of Undergraduate Studies, and approval\nwill only be provided in exceptional cases. Applicants who are\naccepted for the winter semester may start their studies during\nthe previous summer semester. Semesters\nStudies take place across two semesters: the winter semester\n(starts each year in October) and spring semester (starts each\nyear in March). Each semester is 13 weeks, not including\nholidays and vacations. The summer semester lasts about 7\nweeks. In the summer semester, which is an official semester, a\nlimited number of courses are taught; this allows students to\nclose any gaps that they may have in their studies or to progress\nat a faster pace."
  },
  "doc-0af5e6c2eaf5e10d90d9ad09494b9879": {
    "content": "are taught; this allows students to\nclose any gaps that they may have in their studies or to progress\nat a faster pace. Due to the short time span of the semester, the\nnumber of weekly teaching hours for each course is double that\nof a regular semester. It is possible to start one’s studies in any\nsemester (including the summer semester), except for units in\nwhich admission occurs only once a year. Semester-long courses\nThe basic unit of study is a semester-long course, i.e., a course\nthat takes place over the course of one semester."
  },
  "doc-ac8726e9db16a12324fb4a85e79a4e38": {
    "content": "The basic unit of study is a semester-long course, i.e., a course\nthat takes place over the course of one semester. Students are\nexpected to complete the course, take an exam in the course and\nreceive a grade. Students who successfully pass a course, will\nreceive the allotted number of credits for that course. Students\nwho fail the course will not receive credit for the course. Prior to enrolling in a course, students must pass all the\nprerequisites. Students who take a complementary course or a\ncourse that is similar to one that they have already taken, will\nhave the credits they earned in the previous course cancelled\nand then the credits and grade earned in the more recent course\nwill replace it."
  },
  "doc-e9e23196e6fdbb53094d4ac1c5acf11f": {
    "content": "in the previous course cancelled\nand then the credits and grade earned in the more recent course\nwill replace it. Placement exams\nPrior to beginning one’s studies at the Technion, applicants\nmust pass an English placement exam (either via the\npsychometric test or the AMIR test). Applicants who do not\nhave a Bagrut certificate must pass a Hebrew placement exam. Some applicants must also take a placement exam in Physics\nand Chemistry. English placement exam\nTaking an English placement exam is mandatory for anyone\nwho has been accepted to the Technion; this requirement can be\nmet either with the “English” portion of the psychometric test\nor the “AMIR” test."
  },
  "doc-f51af8e83411c35bee34441b4fa35bad": {
    "content": "Technion; this requirement can be\nmet either with the “English” portion of the psychometric test\nor the “AMIR” test. A minimum level of knowledge in English\nis necessary in order to begin one’s studies at the Technion. The\ndifferent placement levels are: Advanced English A, Advanced\nTechnical English B, or Exempt. Physics placement exam\nThe Physics placement exam consists of two parts: mechanics\nand electricity. Passing the mechanics portion of the exam is a\nprerequisite for physics-mechanics courses and passing the\nelectricity portion of the exam is a prerequisite for physics-\nelectricity courses."
  },
  "doc-198ee83d7fdca9f7e6af418b6078dc2b": {
    "content": "courses and passing the\nelectricity portion of the exam is a prerequisite for physics-\nelectricity courses. Exemption from the physics placement exam will be granted in\nthe following circumstances: Students who have been accepted\nto a program in Architecture, Landscape Architecture,\nEconomics, Education in Science and Technology (in the\nbiology, mathematics, or computer science track), or Medicine;\nstudents who have earned at least 4 units of study in physics on\nthe Bagrut and received a grade of 70 or above."
  },
  "doc-66fc2c33c26cd0fad37122a4f875d93c": {
    "content": "students who have earned at least 4 units of study in physics on\nthe Bagrut and received a grade of 70 or above. Exemption from\nthe mechanics portion of the exam will be granted for students\nwho were enrolled in the technological track for practical\nengineers, specializing in mechanics or agricultural mechanics,\nand who have received a grade of 70 or above on the external\nexams in technical mechanics. Exemption from the electricity\nportion of the exam will be granted to students who were\nenrolled in the technological track for practical engineers with\none of the following specializations: Electronics,\nInstrumentation, or Evaluation, and who received a passing\ngrade of 70 or above on the external exams."
  },
  "doc-03f0095431f2313240db52ee40c98fba": {
    "content": "Electronics,\nInstrumentation, or Evaluation, and who received a passing\ngrade of 70 or above on the external exams. Exemption from\nboth parts of the exam will be granted if students earned a grade\nof 70 or above in the following courses at the Open University:\nFundamentals of Physics A (20113) and Fundamentals of\nPhysics B (20114) or Fundamentals of Physics (20125). Exemption from the mechanics portion of the exam will be\ngranted for students who earned a grade of 70 or above in the\nOpen University’s Fundamentals of Physics A (20113) course."
  },
  "doc-fa94087f0311cd61a901f0d5a37588b7": {
    "content": "for students who earned a grade of 70 or above in the\nOpen University’s Fundamentals of Physics A (20113) course. Note: To receive an exemption from the electricity portion of\nthe exam, passing the Fundamentals of Physics B (20114)\ncourse only is not sufficient. === Page 3 ===\nUndergraduate Studies | 2021-2022\nHebrew placement exam\nFor all admitted students who have taken the psychometric test\nin a language other than Hebrew, or who attended a high school\nin which the language of instruction was not in Hebrew, must\ntake a Hebrew proficiency test (YAEL test)."
  },
  "doc-7fe7ab21b003d75e34f5f9e45a8f616c": {
    "content": "a high school\nin which the language of instruction was not in Hebrew, must\ntake a Hebrew proficiency test (YAEL test). A minimum level\nof knowledge in Hebrew is necessary in order to begin one’s\nstudies at the Technion. The different placement levels are:\nHebrew 3 or Exempt with no credit points. Chemistry placement exam\nStudents who have been admitted to tracks in Chemical\nEngineering, Biotechnology and Food Engineering, Biology,\nEnvironmental Engineering, or Biochemical Engineering, and\nwho have not taken an exam of 3 units in chemistry and\nreceived a grade of 70 or above, will need to take the chemistry\nplacement exam."
  },
  "doc-28c470b14493b0f46be0456edb47d0b1": {
    "content": "an exam of 3 units in chemistry and\nreceived a grade of 70 or above, will need to take the chemistry\nplacement exam. Students who have been admitted to these\ntracks but do not pass the placement exam will not be able to\nenroll in the chemistry courses taught during the first semester. Information on preparation courses for the placement exams\nand registration for them can be found on the Undergraduate\nStudies website. Faculty members offering private lessons to students\nat the Technion\nSee page 52."
  },
  "doc-15541cb744a8d70d8597850dcc7d9049": {
    "content": "on the Undergraduate\nStudies website. Faculty members offering private lessons to students\nat the Technion\nSee page 52. Accommodations due to fertility treatments,\npregnancy, childbirth, adoption, guardianship, or\nfoster care\nThe Technion recognizes the importance of the principles set\nforth in the Students’ Rights Act and the rules established by\nthe Council of Education, which increase access to higher\neducation and provide equal opportunities in higher education\nfor students on the basis of fertility treatment, pregnancy,\nchildbirth, adoption, guardianship, or foster care of a child."
  },
  "doc-483df914becb8dbdd3130bdc74b1aa5c": {
    "content": "students on the basis of fertility treatment, pregnancy,\nchildbirth, adoption, guardianship, or foster care of a child. As\nsuch, the Standing Committee of Undergraduate Studies and of\nGraduate Studies has approved, based on the decision made by\nthe academic plenum on August 14, 2012, procedures regarding\naccommodations due to fertility treatments, pregnancy,\nchildbirth, adoption, guardianship, or foster care. The full text\nof these procedures can be found in the Appendix labeled\nAccommodations Due to Fertility, Pregnancy, Childbirth,\nAdoption, Guardianship, or Foster Care at the end of this\ncatalogue."
  },
  "doc-04e2336c98a1988c45246ee513867e9b": {
    "content": "Due to Fertility, Pregnancy, Childbirth,\nAdoption, Guardianship, or Foster Care at the end of this\ncatalogue. The procedures are designed to address the unique\ndifficulties faced by students in these circumstances and to\nidentify the assistance and accommodations to which they are\nentitled. Curriculum\nEach course of study has a defined curriculum consisting of\ncourses that include: mandatory courses, faculty electives, and\ngeneral Technion electives that students can take in any field of\ntheir choice."
  },
  "doc-cdf7e1308f4e066ccf1a8ae057041f36": {
    "content": "courses, faculty electives, and\ngeneral Technion electives that students can take in any field of\ntheir choice. Additionally, the curriculum details the credit\npoints required to obtain the specific degree. Part C of this catalogue includes the recommended curriculum\nper semester for each course of study. The recommended\nschedule of course is based on an average rate of progression of\napproximately 20 credits per semester. Students can progress at\na faster or slower pace than the average, in accordance with\ntheir personal preferences and circumstances."
  },
  "doc-39ce8ac229cd4e59ae346dea4bcfa8fc": {
    "content": "progress at\na faster or slower pace than the average, in accordance with\ntheir personal preferences and circumstances. Prior to each\nsemester, students (preferably with the guidance of an advisor)\nwill choose their own course schedule for the semester and will\nbe responsible for registering for all courses themselves. Once\nthe semester begins, students may still make changes to their\ncourse schedule, up until the course change deadline. It is highly recommended that students who are required to\nenroll in an English language course do so at the start of their\nstudies so that they can best utilize the professional literature in\nEnglish during their studies."
  },
  "doc-aadf1d0830035098a11520eece6a9ca3": {
    "content": "the start of their\nstudies so that they can best utilize the professional literature in\nEnglish during their studies. It is also recommended that\nstudents take humanities courses as part of their elective credits;\nthis is recommended so that students broaden their horizons. In\norder to confirm that students meet all their degree\nrequirements, students will be asked – prior to enrolling in their\nfinal semester – to contact the Undergraduate Academic\nSecretary of their unit to check whether they will have\ncompleted all degree requirements by the end of the final\nsemester."
  },
  "doc-db9b9b3836910b962644367cf3363deb": {
    "content": "of their unit to check whether they will have\ncompleted all degree requirements by the end of the final\nsemester. Students who excel in their studies will be awarded the “Dean’s\nExcellence Award” or the “President’s Excellence Award” and\nreceive a monetary prize. Students who fail will have their\ncircumstances discussed by the academic unit which will\nconsider whether to terminate their studies and then will pass\non their recommendation to the Dean of Undergraduate Studies;\nthis may or may not lead to a discontinuation of their studies."
  },
  "doc-99dd736d7094470bc4a1c926d77b1c76": {
    "content": "recommendation to the Dean of Undergraduate Studies;\nthis may or may not lead to a discontinuation of their studies. Degree conferral\nStudents who have successfully met all the degree requirements\nwill receive a recommendation from the unit to have their\ndegree awarded, which will then be passed to the Dean of\nUndergraduate Studies for approval. Students will receive a\nconfirmation that they have completed their degree, and once a\nyear – in June – a graduation ceremony will be held for all\ngraduates."
  },
  "doc-91becaacf3f60255b299444ae0cc18d8": {
    "content": "they have completed their degree, and once a\nyear – in June – a graduation ceremony will be held for all\ngraduates. Students who have graduated with honors (e.g.,\nmagna cum laude) will have this noted on their diploma. === Page 4 ===\nUndergraduate Studies | 2021-2022\nUndergraduate Studies Regulations\nand Procedures\nIntroduction\nUndergraduate Studies at the Technion are managed by the\nDean of Undergraduate Studies, in consultation with the\nacademic units and in accordance with the decisions of the\nAcademic Plenum and the Senate."
  },
  "doc-dd75c227a349e6e1b535564859447ec7": {
    "content": "in consultation with the\nacademic units and in accordance with the decisions of the\nAcademic Plenum and the Senate. 1. Regulations Regarding the Structure of\nTeaching\n1.1. Course of Study\n1.1.1 Semesters\nStudies take place during the winter semester, the spring\nsemester and the summer semester. The winter and spring\nsemesters each last approximately 13 weeks. The summer\nsemester lasts approximately 7 weeks and typically includes\nlimited course offerings. At the end each semester, there is an\nexam period."
  },
  "doc-f198e2a4ea3c88e13930eb33000c7cad": {
    "content": "7 weeks and typically includes\nlimited course offerings. At the end each semester, there is an\nexam period. 1.1.2 Curriculum\nThe curriculum that must be completed in order to obtain a\nbachelor’s degree (undergraduate studies) is determined by the\nacademic unit and approved by the Senate. The curriculum for\na “Bachelor of Science” degree is based on 4 years of study,\namounting to 155-165 credits. The curriculum in the Faculty of\nArchitecture and Town Planning for a “Bachelor of\nArchitecture” degree is based on 5 years of study, amounting to\n195-205 credits."
  },
  "doc-ce9fd7dbe099a58f6413ca27388fb5e4": {
    "content": "and Town Planning for a “Bachelor of\nArchitecture” degree is based on 5 years of study, amounting to\n195-205 credits. The curriculum for a “Bachelor of Science”\ndegree that is based on 3 years of study that amount to 116-124\ncredits. In addition to determining the credits required to complete the\ncurriculum, each program will include a list of foundational\ncourses, mandatory courses, and faculty elective courses (as\nindicated in Sections 1.1.4-1.1.6 below), as well as the number\nof credits required for each category."
  },
  "doc-ec2258d5b4647b7017443e942ad93e1d": {
    "content": "courses (as\nindicated in Sections 1.1.4-1.1.6 below), as well as the number\nof credits required for each category. The remaining credits required for completing the curriculum\nwill be fulfilled through general elective courses at the\nTechnion, as specified in Section 1.1.7 below. The curriculum submission procedure is specified in Appendix\nA. 1.1.3 Tracks and specializations\nOne academic unit can be responsible for several curricula. When the different curricula of the unit lead to separate degrees,\nthey are defined as separate “tracks.” If the curriculum includes\na particular concentration, it is defined as a “specialization.”\nThe procedure for establishing new tracks and specializations\nis specified in Appendix B."
  },
  "doc-66b1e87aeae4ec25076058e704e85dcb": {
    "content": "as a “specialization.”\nThe procedure for establishing new tracks and specializations\nis specified in Appendix B. 1.1.4 Foundational courses\nFoundational courses include mathematics, physics, chemistry,\nbiology, English, and computer science. The syllabi for the\nfoundational courses are determined by the units responsible for\nteaching the courses (mathematics, physics, biology,\nhumanities, and computer science). The courses that are offered to all units within the Technion are\nspecified in Appendix C."
  },
  "doc-d6125b7404bda82a4644bbb371018a84": {
    "content": "and computer science). The courses that are offered to all units within the Technion are\nspecified in Appendix C. 1.1.5 Mandatory courses\nMandatory courses, as well as foundational courses, are\ndetermined by the Academic Unit’s Council. 1.1.6 Elective courses in the unit\nThe list of elective courses that students can enroll in to\ncomplete their credit quota are specified in the list or lists\nprepared by the academic unit. The number of elective course\ncredits shall not be less than 30 credits in a four-year program\nor 20 credits in a three-year program."
  },
  "doc-1d45e38d24cc5b3cb9c09f208a3b89e9": {
    "content": "elective course\ncredits shall not be less than 30 credits in a four-year program\nor 20 credits in a three-year program. 1.1.7 Free-choice elective courses\nEach study program will include at least 12 credits (10 credits\nin a three-year program) that are to be fulfilled through general\nfree-choice elective courses that can be taken throughout the\ndepartments of the Technion. Of these total credits, at least 6\ncredits must be taken from courses defined as enrichment\nstudies (except for study tracks within the Faculty of Medicine\nand the Faculty of Architecture and Town Planning), and at\nleast 2 credits must be fulfilled through physical education\ncourses."
  },
  "doc-f0f12cb469a70bfaa7c845538478ea79": {
    "content": "of Architecture and Town Planning), and at\nleast 2 credits must be fulfilled through physical education\ncourses. Students’ enrollment in free-choice elective courses\nthat are offered through the Technion are subject to the rules of\nregistration for that course. Surplus credits and credits earned\nfor social activities and reserve service will be recognized for\nthe purpose of fulfilling the general Technion elective credits. 1.1.8 Physical education\nStudents are required to take 2 credits of physical education\ncourses."
  },
  "doc-d85ee91b6ad0267e417f3d5239d34708": {
    "content": "elective credits. 1.1.8 Physical education\nStudents are required to take 2 credits of physical education\ncourses. Students can fulfill this requirement throughout all\ntheir years of study at the Technion, but may not take more than\n1.5 credits per semester. Students who are unable to engage in\nphysical education courses due to health reasons that are\nverified by a doctor’s note will be exempt from this requirement\nbut will not receive any credits."
  },
  "doc-94039a7cbd87ccc63cee0b319b813709": {
    "content": "reasons that are\nverified by a doctor’s note will be exempt from this requirement\nbut will not receive any credits. 1.1.9 Approved student curriculum\nA curriculum that has been approved by the Senate will be\ndesignated as valid for a particular student if it meets the\nfollowing condition: The curriculum was published in the\nUndergraduate Studies Catalogue in the year that the student\nbegan his/her studies or in the catalogue of any academic year\nafter that, or a curriculum that draws on multiple catalogues and\nhas been recommended by the unit and approved by the Dean\nof Undergraduate Studies."
  },
  "doc-6b94fe3789a8ec2176d51f591b2ca15e": {
    "content": "draws on multiple catalogues and\nhas been recommended by the unit and approved by the Dean\nof Undergraduate Studies. === Page 5 ===\nUndergraduate Studies | 2021-2022\n1.2 Syllabi\n1.2.1 Syllabi\nThe Unit’s Council will determine the syllabus for each course,\nwhich then must be approved by the Senate. Each academic unit\nwill arrange for there to be a teaching committee, which will be\nresponsible for updating the syllabi and the list of textbooks. Syllabi for service courses (courses that are provided to another\nunit) should be created in conjunction with representatives of\nthe receiving unit."
  },
  "doc-3541d4e953afda67360894b56a9e2183": {
    "content": "that are provided to another\nunit) should be created in conjunction with representatives of\nthe receiving unit. The council of the unit providing the service\nwill be responsible for its implementation. Each syllabus will\ninclude course objectives, outlined by topic, and will emphasize\nthe principles that will be taught in the course. Each syllabus\nwill be outlined according to chapters in the book or textbook,\nas well as other supplementary material that will be distributed\nto students. A copy of the official syllabus will be distributed to\neach student enrolled in the course."
  },
  "doc-cfea26076e9528e51e2efc96078f0d0b": {
    "content": "be distributed\nto students. A copy of the official syllabus will be distributed to\neach student enrolled in the course. Each academic unit must\nreview and, if necessary, update the curriculum at least once\nevery three years. 1.2.2 Determining the number of credits per course\nThis guide is to be used to determine the number of credits per\ncourse: one lecture hour = 1 credit; one practicum hour = ½\ncredit; one lab hour = 1/3 credit (except for projects). The credit\namount should be rounded to the nearest half point."
  },
  "doc-54d6bc1badbcefd827f2f5bc2ec2e391": {
    "content": "credit; one lab hour = 1/3 credit (except for projects). The credit\namount should be rounded to the nearest half point. Credits can\nbe increased for increased workloads. However, the number of\ncredits cannot be less than the number determined by the above\nguide. Currently, courses in the Humanities and Arts that\ninclude 2 hours of lecture can be worth 1.5 credits. Course\ncredits are determined according to the hours of work required\nof the student in practice. In general, 50-60 hours of work per\nweek is equivalent to 20 credits."
  },
  "doc-0b02c6dc6a38698a1f2235d86112b0fe": {
    "content": "of work required\nof the student in practice. In general, 50-60 hours of work per\nweek is equivalent to 20 credits. 1.2.3 Connection between courses\nA. Prerequisites\nA prerequisite is a course that must be completed (and passed)\nprior to enrolling in the course in question. Registration to the\ncourse will not be denied if the prerequisite requirement is not\nfulfilled. However, the instructor will receive a notification and\nwill be able to deny the student enrollment in the course (despite\nthe advisor’s approval)."
  },
  "doc-7fde87ebe8ed25851bbbf67f2ede2dbf": {
    "content": "receive a notification and\nwill be able to deny the student enrollment in the course (despite\nthe advisor’s approval). Advisors are asked to carefully\nconsider each approval and limit it to students in good standing\nonly. B. Corresponding courses\nThe course in question should not be taken before its\ncorresponding course. All guidelines regarding approval for\nenrolling in a course for which the prerequisites were not\nfulfilled, also applies in this circumstance. C. Courses without additional credit\nCourses that contain a lot of similar material are defined as\ncourses without additional credit."
  },
  "doc-85a9d61913fe85991f6304df2841dbb2": {
    "content": "additional credit\nCourses that contain a lot of similar material are defined as\ncourses without additional credit. That is, students who enroll\nin two such courses will not receive any additional credits. Students will not be able to simultaneously enroll in two\ncourses that are specified as courses without additional credit. If a student has successfully passed a specific course and then\nenrolls in a course without additional credit, the credits that\nhe/she earned in the first course will be revoked and the grade\nearned in the second course will prevail."
  },
  "doc-30bc5c7c0eee91cf61d10bd18bbb9b8a": {
    "content": "credits that\nhe/she earned in the first course will be revoked and the grade\nearned in the second course will prevail. If the student passes\nthe course, the number of credits that he/she will earn will be in\naccordance with the most recent course taken. When the material taught in the course without additional credit\nincludes all the material from the second course, as well as\nadditional material, the first course will be termed “inclusive”\nand the second course will be called “included.”\n1.3 Courses to be Completed Prior to Starting One’s\nStudies\n1.3.1 Standard level\nEach unit will determine, with the Senate’s approval, the\nrequired level to begin taking foundational courses (hereinafter,\nthe standard level)."
  },
  "doc-5e2652926506173fccfce200025f451f": {
    "content": "with the Senate’s approval, the\nrequired level to begin taking foundational courses (hereinafter,\nthe standard level). Based on this determination, a\nrecommended curriculum will be constructed. This will also\ndetermine whether the specified level is a firm condition for\nstudent admission or whether candidates with a sub-standard\nlevel can be accepted, so long as they complete the missing\nrequirements. These courses will be prerequisites for the\nrelevant course in the curriculum. Hebrew studies are not\nconsidered to be a prerequisite for starting one’s degree\nprogram."
  },
  "doc-f037a754f11f3d1d6499259343004f91": {
    "content": "course in the curriculum. Hebrew studies are not\nconsidered to be a prerequisite for starting one’s degree\nprogram. We recommend that students who are required to\nfulfill these prerequisite course requirements enroll in a more\nlimited course of study. 1.3.2 Placement exams in physics (Mechanics + Electricity)\nStudents must pass Part A of the Placement Exam (Mechanics)\nprior to the start of the third semester of their studies and Part B\nof the Placement Exam (Electricity) prior to the start of the\nfourth semester of their studies."
  },
  "doc-bb3022c6079a9ba20de3d9a627f3bba0": {
    "content": "studies and Part B\nof the Placement Exam (Electricity) prior to the start of the\nfourth semester of their studies. In addition, each unit may, with\nthe approval of the Dean of Undergraduate Studies, set an\nearlier date by which students must pass the two parts of the\nplacement exam in physics. Students who do not fulfill this\nrequirement will be considered to be in “poor academic\nstanding” (see Regulation 3.1.5). The placement exam in physics is mandatory for all students\nwho are admitted to the Technion, except for students admitted\nto programs in Architecture, Landscape Architecture,\nEconomics, Education in Science and Technology (in the\nbiology, mathematics, or computer science track), or Medicine."
  },
  "doc-e1600141d88dceb262499e5074838018": {
    "content": "Economics, Education in Science and Technology (in the\nbiology, mathematics, or computer science track), or Medicine. Additional exceptions include:\nA. Students who have completed at least 4 units of physics in\nthe matriculation (Bagrut) exam and received a grade of 70 or\nabove. B. Exemption from Part A of the Placement Exam (Mechanics)\nwill be provided to students who have completed the\ntechnological track for practical engineers, specializing in\nmechanics or agricultural mechanics, and who have received a\ngrade of 70 or above on the external exams in technical\n\n=== Page 6 ===\nUndergraduate Studies | 2021-2022\nmechanics."
  },
  "doc-aa4cbf8444b024d13d07487fa185a9cf": {
    "content": "a\ngrade of 70 or above on the external exams in technical\n\n=== Page 6 ===\nUndergraduate Studies | 2021-2022\nmechanics. Exemption from Part B of the placement exam\n(Electrical) will be granted to students who completed the\ntechnological track for practical engineers with one of the\nfollowing specializations: Electronics, Instrumentation, or\nEvaluation, took their exams, and received a score of 70 or\nabove on their external exams in their primary area of the\nspecialization. C. Anyone who has studied physics at the university level in\nIsrael or abroad and who received a passing grade, according to\nwhat is customary in the relevant institution, will receive full\nexemption from the physics placement exam."
  },
  "doc-305e2142641915c6f0d1b96d4e6ff8c9": {
    "content": "to\nwhat is customary in the relevant institution, will receive full\nexemption from the physics placement exam. D. New immigrants who went to high school abroad will submit\ntheir application for exemption to the Committee for the\nExamination of Diplomas, which will consult with the Faculty\nof Physics as necessary. The exemption will be approved as per\nthe recommendations of the committee. Passing Part A of the placement exam in Physics or being\nexempt from it is a condition for taking the following courses:\nPhysics 1 or Physics 1M or Physics 1R or Physics 1P."
  },
  "doc-967e18fc5d396a3d7d3fbecd87937c52": {
    "content": "exempt from it is a condition for taking the following courses:\nPhysics 1 or Physics 1M or Physics 1R or Physics 1P. Passing\nPart B of the placement exam in Physics or being exempt from\nit is a condition for taking the following courses: Physics 1 or\nPhysics 1M or Physics 1R or Physics 1P. 1.3.3 English studies\nThe Placement Exam in English is mandatory for anyone\naccepted to the Technion. The “English” portion of the\npsychometric exam or on the “AMIR” test or on the SAT is\nconsidered to be a placement exam."
  },
  "doc-5b19b0ec04c2391104a84c604194c4e1": {
    "content": "“English” portion of the\npsychometric exam or on the “AMIR” test or on the SAT is\nconsidered to be a placement exam. A minimum level of\nknowledge in English is necessary in order to be accepted to the\nTechnion. The different placement levels are: Advanced\nEnglish A, Advanced Technical English B, or Exempt. Exemption from the Placement Exam in English will be granted\nto those who have earned a satisfactory grade on the English\nportion of the psychometric exam, the AMIR test, the SAT\nexam, or in previous coursework."
  },
  "doc-876eda55b64cdf781b742baf89df8a94": {
    "content": "grade on the English\nportion of the psychometric exam, the AMIR test, the SAT\nexam, or in previous coursework. The “Advanced English A”\ncourse and the “Advanced Technical English B” courses are\noffered through the Department of Humanities and Arts at the\nTechnion. The “Advanced English A” course is a prerequisite\nfor the “Advanced Technical English B” course. The\n“Advanced English A” course does not grant any course credits. The “Advanced Technical English B” course grants 3 credits\n(with a grade)."
  },
  "doc-ecd5950592ca8dc221ccefdd90d76ee9": {
    "content": "A” course does not grant any course credits. The “Advanced Technical English B” course grants 3 credits\n(with a grade). Exemption from the English course requirement\ngrants 3 credits (without a grade). All students who begin their studies at the Technion starting in\nthe 2021-2022 academic year must take at least 2 English\nlanguage courses during their undergraduate studies. This\nrequirement can be fulfilled by taking two English language\nlearning courses (Advanced A and B) or two content courses\nthat are taught in the English language, or one English language\nlearning course and one content course that is taught in English."
  },
  "doc-1e6669da8a2de923b78c91b64c9dac5c": {
    "content": "in the English language, or one English language\nlearning course and one content course that is taught in English. This requirement will be determined in accordance with\nstudents’ placement level that is determined at the start of their\nstudies. The content courses that are taught in English will be\nacademic courses that are part of the student’s standard\ncurriculum. The English language learning courses must be\ncompleted within a maximum of four semesters. A student who\nhas not fulfilled this requirement will be considered to be a\nstudent in “poor academic standing” [see Section 3.1.5.A (5)]."
  },
  "doc-23916c871798d86d51def4be78c159ec": {
    "content": "fulfilled this requirement will be considered to be a\nstudent in “poor academic standing” [see Section 3.1.5.A (5)]. Students who have not completed two of the aforementioned\nEnglish courses will not be able to complete their\nstudies/receive their degree. 1.3.4 Hebrew studies\nAll admitted students who did not take the psychometric exam\nin Hebrew must pass a Hebrew placement exam. A minimum\nlevel of knowledge in Hebrew is necessary in order to be\naccepted into the Technion -113. The different placement levels are: Hebrew 3 or Exempt (which\ndoes not grant any credit points)."
  },
  "doc-cff1c287714a2d153385957396ebd91a": {
    "content": "the Technion -113. The different placement levels are: Hebrew 3 or Exempt (which\ndoes not grant any credit points). The “Hebrew 3” course will\nbe offered through the Pre-Academic Education Center\n(preparatory). A passing grade in the “Hebrew 3” course will\ngrant 3 credit points (without a grade; P+). These credits are\nconsidered to be part of the Technion general elective credits. Students who do not fulfill the Hebrew language requirements\nby the end of their second semester at the Technion will be\nconsidered to be a student in “poor academic standing” [see\nSection 3.1.5.(B) (6)]."
  },
  "doc-93a0541e6df87119537be3b60b2383ff": {
    "content": "semester at the Technion will be\nconsidered to be a student in “poor academic standing” [see\nSection 3.1.5.(B) (6)]. 1.3.5 Grades in courses that must be completed prior to\nstarting one’s studies\nCourses that must be completed prior to beginning one’s studies\ndo not result in a grade; rather, these courses are pass/fail. These\ncourses are prerequisites for the relevant courses/subjects. 2. Regulations Relating to the Provision of\nInstruction\n2.1 Instruction\n2.1.1 Teaching methods\nInstructors will choose which material they will present to\nstudents during their lecturers from the syllabus, and can lecture\non any other material that they see fit."
  },
  "doc-b8c5e689f22fde174419ede36841dbed": {
    "content": "present to\nstudents during their lecturers from the syllabus, and can lecture\non any other material that they see fit. However, the exams will\nbe based upon the official syllabus, including chapters/sections\nthat the instructor did not lecture on. 2.1.2 Guided reading\nIf there is no standard form of instruction for a particular\nsubject/course in one of the semesters, and if the nature of the\nsubject lends itself to learning in a guided reading format,\nstudents can be instructed in this way after special approval is\ngiven by the head of the unit."
  },
  "doc-53a7b568ada7f0b78b33797bc41ffb4b": {
    "content": "guided reading format,\nstudents can be instructed in this way after special approval is\ngiven by the head of the unit. Guided reading consists of:\nholding regular meetings (at least once a week) with the\ninstructor in charge, as well as submitting assignments as\n\n=== Page 7 ===\nUndergraduate Studies | 2021-2022\nrequired. The syllabus will be set in accordance with the points\nspecified in Section 1.2.1. 2.1.3 Instructor responsible for the course\nEach course that is offered by more than one instructor, will\nhave one instructor who is appointed by the head of the unit to\nwhich the instructors belong to be the instructor responsible for\nthat course."
  },
  "doc-0be1306845492f922d173547fd9160c2": {
    "content": "is appointed by the head of the unit to\nwhich the instructors belong to be the instructor responsible for\nthat course. In addition to being responsible for course\ninstruction, this instructor will also be responsible for the exam\nand grades in the particular course. 2.2 Exams\n2.2.1 Evaluating course performance\nInstructors are responsible for assessing students’ level of\nlearning and the course exam can be used as one of the means\nto achieve this goal; however, the instructor is not obligated to\nhold an exam at the end of the course."
  },
  "doc-e1110c0ef3533ed5d4cd7d141f17cec7": {
    "content": "of the means\nto achieve this goal; however, the instructor is not obligated to\nhold an exam at the end of the course. 2.2.2 Standardized evaluation\nTo the extent that the course is taught by several different\ninstructors at the same time, the head instructor will be\nresponsible for ensuring that the exam is standardized across\ninstructors, and that the method of evaluation is identical. In\naddition, the head instructor will be the one to approve the\ngrades given to students. 2.2.3 Exam dates\nAt the end of each semester, there will be a period of three\nweeks during which the first exam dates (Moed A) and then the\nsecond exam dates (Moed B) for all courses will be held."
  },
  "doc-f1be4f381016f99da8a838a60c6413e9": {
    "content": "weeks during which the first exam dates (Moed A) and then the\nsecond exam dates (Moed B) for all courses will be held. During\nthe period of time designated for exams, no exams will be held\nfor courses worth fewer than 1.5 credits. In these courses,\ngrades will be determined on the basis of tests and/or exams that\nwere held during the course of the semester. There is no option\nto hold these final exams earlier in the semester, and definitely\nnot during the last week of the semester."
  },
  "doc-05fc36a47d78a7a012cd091f1ef24426": {
    "content": "no option\nto hold these final exams earlier in the semester, and definitely\nnot during the last week of the semester. In courses in which\nweight is given to grades provided throughout the semesters and\ntests are held throughout the duration of the semester, it will be\npossible to hold a test during the last week of the semester,\nprovided that it is held during the standard course time and is\nsimilar in scope to the other tests. 2.2.4 Exam Procedures\nThe Undergraduate Academic Secretary will determine and\npublish the exam schedule and locations, as well as the seating\narrangements for the exams and the division of students\nbetween the rooms."
  },
  "doc-dd4ccc53545b1494e1ddb6da97d89265": {
    "content": "and locations, as well as the seating\narrangements for the exams and the division of students\nbetween the rooms. Each student will receive an exam card in\nwhich details of his/her exams in each course for which they are\nenrolled in that semester is specified. 2.2.5 Mid Exams\nThe number of mid exams for a given course is limited as\nfollows: No more than three mid exams can be given in a course\nfor which the mid exam replace a final exam, and no more than\none valid mid exam can be given in a course for which there is\na final exam."
  },
  "doc-e648ae05d401eb5b09c5a5e560d099c2": {
    "content": "replace a final exam, and no more than\none valid mid exam can be given in a course for which there is\na final exam. Each mid exam shall not exceed two hours and for\neach valid mid exam that is given, there must be a second date\n(Moed B) on which students can take the test. 2.3 Credits and Grades\n2.3.1 Semester-long courses\nThe course of study for a degree consists of semester-long\ncourses. Students (besides those in the Faculty of Medicine)\nwill be allowed to register for more than 29 credits per semester\nonly if the head of the unit has recommended this and the Dean\nof Undergraduate Studies has approved it."
  },
  "doc-df80da91053c54700f7a9ee443fd2a92": {
    "content": "per semester\nonly if the head of the unit has recommended this and the Dean\nof Undergraduate Studies has approved it. Students who are\nenrolled in a course receive a university grade at the end of the\nsemester that reflects their performance in the course: A grade\nof 55 or above reflects a passing grade and the student will\nreceive the allotted number of credits for the course. A grade\nbelow 55 will reflect a failing grade and the student will not\nreceive any course credit. In both cases, the score will be\nincluded in the calculation of the student’s weighted cumulative\naverage."
  },
  "doc-c7df5eef3a6fb327863b3bfd0739f4f5": {
    "content": "credit. In both cases, the score will be\nincluded in the calculation of the student’s weighted cumulative\naverage. There are a small number of courses in which the\ngrading system is binary --pass/fail. A passing grade entitles\nthe student to credits whereas a failing grade does not grant the\nstudent any credits. A binary grade does not influence the\ncumulative average. A student who is registered for a course but\ndoes not fulfill one of the requirements of the course, such as a\nfinal exam or submission of a project, might not receive a final\ngrade, as per the discretion of the lecturer."
  },
  "doc-d43819d9219b7ac07a5effbf8e149396": {
    "content": "as a\nfinal exam or submission of a project, might not receive a final\ngrade, as per the discretion of the lecturer. Such a course will\nbe counted in the “Course Success Rate” (see Section 3.1.5\nbelow). Eight weeks after the start of the following semester,\nthe student will receive an “incomplete” for that course. For\nsimilar projects and courses, in which assignments last more\nthan one semester, the Dean of Undergraduate Studies may\ndelay the recording of the “incomplete” grade until the end of\nthe following semester."
  },
  "doc-ad8e26bd74de5490cc9a28b1b3dd33c9": {
    "content": "of Undergraduate Studies may\ndelay the recording of the “incomplete” grade until the end of\nthe following semester. Students who are not registered for a\ncourse will not be able to receive a grade in that course. 2.3.2 Course exemptions\nStudents will be able to receive an exemption from courses if\nthey can prove their knowledge in the subject in the following\nways: Previous coursework (excluding high school studies) or\nby way of an exam. Exemption can be granted with credit (P+)\nor without credit (P-), as per the recommendation of the unit’s\nundergraduate studies center."
  },
  "doc-beb744090fdd9c7ede9e748d6cece130": {
    "content": "granted with credit (P+)\nor without credit (P-), as per the recommendation of the unit’s\nundergraduate studies center. Exemptions will not be granted for courses taken at any\ninstitution during the period in which a student was expelled\nfrom the Technion due to a violation of disciplinary regulations. 2.3.3 Publication of grades and appeals of final exam\ngrades\n2.3.3.1 The course instructor will send all students their exam\nscore within 10 days of the exam. 2.3.3.2 The course instructor will submit the list of grades in\nthe course to the individual responsible for the course’s\ninstruction in the unit, and if there are no reservations, the list\nof grades will be forwarded on to the Undergraduate Academic\n\n=== Page 8 ===\nUndergraduate Studies | 2021-2022\nSecretary."
  },
  "doc-087d7c349bd36fcb513ef4bd44225e2b": {
    "content": "grades will be forwarded on to the Undergraduate Academic\n\n=== Page 8 ===\nUndergraduate Studies | 2021-2022\nSecretary. At the same time, the information will be\ncommunicated to the students. 2.3.3.3 Students who wish to appeal their grade, may do so\nwithin four days from when a copy of their exam booklet was\nmade available. For the purpose of filing the appeal, students\nwill be entitled to receive a copy of their exam booklet. Students\nwill submit their request for appeal either orally or in writing,\nas per the instructions of the instructor."
  },
  "doc-e02e1e0c2bd0d8dd32339f8455a42a42": {
    "content": "Students\nwill submit their request for appeal either orally or in writing,\nas per the instructions of the instructor. 2.3.3.4 The course instructor will submit a response to the\nstudent regarding his/her appeal of the score on the first exam\n(Moed A), which is to be submitted in the period specified\nabove, no later than one week before the second date of the\nexam (Moed B). If no response is provided, the student will be\nentitled to take the exam again (Moed B) on a special date,\nwhich will be at least one week after the student receives a\nresponse to their appeal, provided that it is before the exam\nperiod of the following semester."
  },
  "doc-5c8bc18927872180811bea55d1f018b6": {
    "content": "the student receives a\nresponse to their appeal, provided that it is before the exam\nperiod of the following semester. 2.3.3.5 In exceptional cases, changes to this procedure will be\napproved by the Dean of Undergraduate Studies, especially for\ncourses in which the period of time between the first and second\ndate of the exam is short. In these cases, an effort shall be made\nto coordinate with the student representatives. 2.4 Reserve Duty\nThe Senate recognizes the disruption to students’ studies that\nresults from reserve service and from service within the\nframework of the academic reserve (hereinafter: reserve duty)\nduring the course of the semester and/or the exam period."
  },
  "doc-ccd6f218b715f8229190bb84932dc91a": {
    "content": "framework of the academic reserve (hereinafter: reserve duty)\nduring the course of the semester and/or the exam period. The\nSenate calls on the heads of the academic units and lecturers to\nalleviate the distress of those serving in the reserves and\nparticularly to those serving for long periods of time during the\nsemester (including the exam period). The academic units must\nmake every effort to allow students to complete the course\nmaterial and all course requirements in the semester in which\nthey are enrolled."
  },
  "doc-808916d1802dcabaec96b751b7339dc1": {
    "content": "allow students to complete the course\nmaterial and all course requirements in the semester in which\nthey are enrolled. The Senate asks all bodies that deal with this\nmatter to do everything in their power so that the disruption is\nminimized. The purpose of this regulation is to try and\nminimize the harm to students’ studies among those who are\nserving in the reserves. Students who serve in the reserves during the semester will be\nentitled to solutions that will minimize any harm to their\nstudies, the grades that they deserve or the duration of their\nstudies."
  },
  "doc-573e4d5b3d266c36f43c388652f1094a": {
    "content": "solutions that will minimize any harm to their\nstudies, the grades that they deserve or the duration of their\nstudies."
  },
  "doc-9ce350cba709d0745ed0fc63bde5f983": {
    "content": "that will minimize any harm to their\nstudies, the grades that they deserve or the duration of their\nstudies. These solutions, in regard to ensuring that students are\nable to fulfill course requirements (e.g., tests/exams, labs,\npracticums), may include a test/exam, practicum, additional\nwork, permission to bring a formula page to the exam, etc., as\nspecified below:\nAbsence from an exam\nStudents are entitled to not take an exam during the exam period\nand to receive an alternative solution, such as taking the exam\nat a different date, if one of the following conditions are met:\n Reserve service on the day of the exam (except for\nconferences/interviews in which one can choose the date of\nparticipation);\n Reserve service of at least three days per week prior to the\nexam date;\n Reserve service of at least 10 consecutive days or 14 days in\ntotal during the semester, up until the start of the exam period;\n Reserve service of at least 10 days in total during the exam\nperiod."
  },
  "doc-2189299d2b24e5383c2bb585e258022a": {
    "content": "semester, up until the start of the exam period;\n Reserve service of at least 10 days in total during the exam\nperiod. If the course instructor sets another date for the exam as a\nsolution, the date of the alternative exam shall be no later than\nfive weeks after the publication of grades of the second exam\ndate (Moed B). The faculties are responsible for setting the date\nof the exam for reservists while taking into account the tests and\nexam dates of other courses in the current semester. The above instructions also apply to valid tests."
  },
  "doc-7eedb7647cc997cb7d43cd2a984613fc": {
    "content": "the tests and\nexam dates of other courses in the current semester. The above instructions also apply to valid tests. In the case of a “protective” exam, the solution offered will be\nthe responsibility of, and at the discretion of, the lecturer, and\nwill be implemented in such a way that does not harm the\nstudent. Instead of a taking the exam on the alternative date, students\nwill be able to cancel their course registration or can choose to\nrepeat the course at a later time. In the case that the student chooses to repeat the course:\n The recorded grade will be “incomplete”."
  },
  "doc-0253f6a24a9ee087879ba295cb3b5b04": {
    "content": "at a later time. In the case that the student chooses to repeat the course:\n The recorded grade will be “incomplete”.  The course will not be included in the course success rate\ncalculation.  The grade will be recorded in the semester in which the\nrequirements are completed. Students will be eligible to transfer the course grades they\nreceived during the course of the semester in which they had\nreserve duty, in accordance with the course requirements for the\nsemester to which they are transferring the grades; the instructor\nshall help the student do so in a way that does not harm the\nstudent nor the efforts he/she has invested during the semester\nin which he/she had reserve duty."
  },
  "doc-f539753bda93d0873b53fe0309f0a061": {
    "content": "does not harm the\nstudent nor the efforts he/she has invested during the semester\nin which he/she had reserve duty. The request will be honored\nby the unit offering the course. Regulations regarding prerequisites of subsequent courses will\nnot be implemented. Exam appeals\nStudents who are not around during the appeal period due to\nreserve duty, will receive an extension for the date by which the\nappeal must be filed in accordance with the number of days that\nthey were in reserve duty. Assignments\nStudents who are absent due to reserve duty in the two weeks\nprior to the submission deadline of an assignment will receive\nan extension for at least the number of days that they were in\nreserve duty."
  },
  "doc-3fd4e76feb2032e05247bec72d1dedcc": {
    "content": "deadline of an assignment will receive\nan extension for at least the number of days that they were in\nreserve duty. In the case that the new submission date falls\nduring the exam period, the deadline will be postponed until\nafter the exam period. === Page 9 ===\nUndergraduate Studies | 2021-2022\nThe extension will also apply to the students’ partners on a\ngroup assignment. For students who missed the submission deadline of a\nsignificant number of assignments in the course due to reserve\nduty of 14 days or longer, the instructor will determine an\nalternative solution for submitting the assignments."
  },
  "doc-2f46d749eae22e2c670885b22c668f1f": {
    "content": "duty of 14 days or longer, the instructor will determine an\nalternative solution for submitting the assignments. Time extensions\nStudents will be eligible to receive 25% additional time on the\nfirst exam that they take in each course during the current\nsemester if one of the following conditions is met:\nActive reserve duty for a cumulative period of 14 days during\nthe semester, up until the start of the exam period;\nActive reserve duty for a period of 10 days or more in the four\nweeks prior to the exam period;\nActive reserve duty for 10 consecutive days or more during the\nexam period."
  },
  "doc-984edccd8ef00da54acfcd9565c925f9": {
    "content": "in the four\nweeks prior to the exam period;\nActive reserve duty for 10 consecutive days or more during the\nexam period. 2.5 Recognized Social Activity in Exchange for\nAcademic Credits\nUndergraduate students who participated in a recognized social\nactivity for the benefit of the community. without receipt of\ncompensation, in the amount of 26 hours per semester during\nthe course of the year will be eligible to receive one credit\ntowards the general Technion elective credit requirement for\ntheir degree."
  },
  "doc-987703ac6161030c38676e7e4b9d68b9": {
    "content": "year will be eligible to receive one credit\ntowards the general Technion elective credit requirement for\ntheir degree. Undergraduate students who participated in a recognized social\nactivity for the benefit of the community, without receipt of\ncompensation, in the amount of 30 hours throughout the year or\nserved in active reserve duty for at least 14 days throughout the\nyear will be eligible to receive two credits towards the general\nTechnion elective credit requirement for their degree. The maximum number of credits in regard to Regulation 2.5\nthat can be grated during the student’s degree studies is 2\ncredits."
  },
  "doc-9325777524e122a6a26a91a086716d14": {
    "content": "number of credits in regard to Regulation 2.5\nthat can be grated during the student’s degree studies is 2\ncredits. 3. Student Regulations\n3.1 Course of Studies in a Bachelor’s Degree Program\n3.1.1 Counseling\nWe recommend that all students utilize academic counseling in\ntheir unit to help them to choose a program of study and to assist\nthem with all other academic matters. 3.1.2 Course registration\nStudents shall enroll for courses for the winter and spring\nsemesters prior to the start of each semester."
  },
  "doc-3be52e8c284a35c47e419b9a53b04977": {
    "content": "registration\nStudents shall enroll for courses for the winter and spring\nsemesters prior to the start of each semester. For courses that\nare not project-based or laboratory-based, students may make\nchanges to their course list/schedule of classes within the first\ntwo weeks of the semester. After the registration and course\nchange period ends (that is, from the start of the semester for\nproject-based and laboratory-based courses and from the start\nof the 3rd week of the semester for all other courses), changes\ncan only be made in accordance with the guidelines specified in\nadvance by the unit responsible for the course and with the\napproval of the Dean of Undergraduate Studies."
  },
  "doc-405a8404aa5fb8e45d59b7d240cfd2af": {
    "content": "specified in\nadvance by the unit responsible for the course and with the\napproval of the Dean of Undergraduate Studies. Starting from the end of the 4th week of the semester, or 3 weeks\nafter the end of the second exam date (Moed B) of the previous\nsemester (whichever comes later), no additional changes can be\nmade except for in exceptional cases and with the approval of\nthe Dean of Undergraduate Studies. New students who do not enroll in any courses in their first\nsemester will not have their place saved at the Technion."
  },
  "doc-506d87bdcca5aa5b0e11bb35ea02df3c": {
    "content": "New students who do not enroll in any courses in their first\nsemester will not have their place saved at the Technion. In\nexceptional circumstances, the Dean of Undergraduate Studies\nwill approve of an extension to the start of studies for such\nstudents. 3.1.3 Exams and re-enrollment in courses\nA. Students may take the exam on the first date that it is offered\n(Moed A) and/or the second date that it is offered (Moed B). B. Students may re-enroll in any course that they have previous\ntaken in order to improve their grade in the course in the two\nsemesters following the one in which they earned a “passing”\ngrade for the first time."
  },
  "doc-e9ccf80cce16e189a228498a064efb2f": {
    "content": "grade in the course in the two\nsemesters following the one in which they earned a “passing”\ngrade for the first time. C. In exceptional circumstances, additional exam dates will be\napproved for the purpose of improving one’s grade, with the\nrecommendation of the academic unit and the approval of the\nDean of Undergraduate Studies. Special consideration will be\ngiven to matters related to courses that are offered annually. D. Students may re-enroll in any mandatory courses of their\ncurriculum if the last grade they received in the course was a\n“failing” grade."
  },
  "doc-a18487fa5cdd30698cfb5560b1b21a12": {
    "content": "in any mandatory courses of their\ncurriculum if the last grade they received in the course was a\n“failing” grade. E. Students may enroll in advanced project courses or\nlaboratory-based courses (e.g., a “studio” course in the Faculty\nof Architecture and Town Planning) up to two times at most. The list of courses to which this provision applies will be\nperiodically updated by the Dean of Undergraduate Studies. F. In any case, the last score received is the determining score. 3.1.4 Academic excellence\nA."
  },
  "doc-2a0d79b1cc373951224e206ac4a93f0e": {
    "content": "Undergraduate Studies. F. In any case, the last score received is the determining score. 3.1.4 Academic excellence\nA. The study tracks will be periodically divided, by the Dean\nof Undergraduate Studies and in consultation with the heads of\nthe academic units, into groups that, for the purposes of this\nsection, are called “study routes.” The list of study routes will\nbe published on the Undergraduate Studies website. B. The Dean of Undergraduate Studies will determine and\npublish, prior to the President’s Excellence Awards ceremony\nheld each semester, the numerical thresholds for eligibility for\nthe President’s Excellence and Dean’s Excellence Awards for\neach study route."
  },
  "doc-3b6ff585ce895bd5b9c9bd75cd915216": {
    "content": "numerical thresholds for eligibility for\nthe President’s Excellence and Dean’s Excellence Awards for\neach study route. The thresholds will be determined on the basis\nof academic performance in the previous semester. The\nthresholds will be set in such a way such that, in each study\n\n=== Page 10 ===\nUndergraduate Studies | 2021-2022\nroute, there will be approximately 3% of students who will\nreceive the President’s Excellence Award and approximately an\nadditional 15% of students who will receive the Dean’s\nExcellence Award (including those receiving the President’s\nExcellence Award) – and under the condition that the threshold\ndoes not fall under 91 (President’s Excellence) and 84 (Dean’s\nExcellence)."
  },
  "doc-5c41d974a3e3dd83665d793edb90ea58": {
    "content": "and under the condition that the threshold\ndoes not fall under 91 (President’s Excellence) and 84 (Dean’s\nExcellence). C. The criteria for receiving the President’s Excellence Award\nare a minimum of 18 accumulated credits earned in courses\nincluded in the curriculum for the current semester and an\naverage grade of 91 or above, provided that this average grade\ndoes not fall below the threshold set forth in Section B above. The criteria for the Dean’s Excellence Award are a minimum\nof 18 credits earned in courses included in the curriculum for\nthe current semester and an average grade of 84 or above,\nprovided that the average grade does not fall below the\nthreshold set forth in Section B above."
  },
  "doc-ac4761adfb2b8327f3b79b512cc530e4": {
    "content": "grade of 84 or above,\nprovided that the average grade does not fall below the\nthreshold set forth in Section B above. 3.1.5 Students in poor academic standing\nA. Students will be considered to be in poor academic standing\nif they meet at least one of the following conditions:\n1. A weighted cumulative GPA of less than 65. 2. A course success rate of less than 66%. 3. The student was in poor academic standing in the prior\nsemester and did not fulfill the curriculum set forth for him/her. 4. The student did not fulfill his/her obligation to take the\nPhysics Placement Exam by the required deadline (see\nRegulation 1.3.2)."
  },
  "doc-f7d551b6f150f59f83da36bed7e8397f": {
    "content": "did not fulfill his/her obligation to take the\nPhysics Placement Exam by the required deadline (see\nRegulation 1.3.2). 5. The student did not complete his/her English studies\nrequirement by the end of the fourth semester of his/her studies\n(see Regulation 1.3.3). 6. The student did not complete his/her Hebrew studies\nrequirement by the end of the second semester of his/her studies\n(see Regulation 1.3.4). 7. The student has been studying for the degree for two years\nor more beyond the standard number of years designated for the\ndegree; that is, the student is in his/her 13th semester or beyond\n(of a four-year degree program) or in the 11th semester or\nbeyond (of a three-year degree program), and so on."
  },
  "doc-2d1f90376c2b8135c5f1c96cf5480a56": {
    "content": "beyond\n(of a four-year degree program) or in the 11th semester or\nbeyond (of a three-year degree program), and so on. 8. The student has accumulated fewer than 27 credits during\nthe first two semesters of his/her studies from the recommended\ncourse schedule of the study track in which they are enrolled. For the purpose of this clause:\n-The English requirement will be recognized as an\naccumulation of 2 credits, and the Physics requirement will be\nrecognized as an accumulation of 4 credits. Students who are\nexempt from taking the Technical English course or for whom\nthe course does not appear on the course list for their first year\nof the study track, will be “debited” 24 credits."
  },
  "doc-f2fa49aac98e78c64cbb451207d198a9": {
    "content": "the course does not appear on the course list for their first year\nof the study track, will be “debited” 24 credits. -This clause does not apply to students who have been\nadmitted to the Technion on the basis of their academic\nbackground. B. Students’ progress in their degree program will be evaluated\nat the end of the first and second semesters and, in more\nadvanced years, also at the end of the summer semester, and\nafter other semesters as required by regulations. C. Students who are in poor academic standing will be invited\nto their academic unit for counseling and guidance."
  },
  "doc-ea45d9fb2f9ae3e0d3bbd9594653df1c": {
    "content": "C. Students who are in poor academic standing will be invited\nto their academic unit for counseling and guidance. The\nacademic unit will hold a discussion and, depending on the\nseverity of the student’s situation, will recommend – to the\nDean of Undergraduate Studies – conditions for continuing on\nin the program (e.g., specifying a a mandatory course of\nstudy/curriculum for one semester or one year, or other\nrequirements) or will recommend that the student’s studies be\nterminated. During the course of the discussions, the student\nwill have the right to make his/her arguments."
  },
  "doc-ef2020fea783bc88cfe828c7e43ad052": {
    "content": "studies be\nterminated. During the course of the discussions, the student\nwill have the right to make his/her arguments. In addition,\nconsideration will be given to the opinion of the Student\nCounseling and Support Center as well as to special\ncircumstances such as reserve duty. The academic unit will\ninform the student of its recommendation, which will be shared\nwith the Dean of Undergraduate Studies who will make a\ndecision about how to proceed. The academic unit will\ndetermine the responsible body for providing counseling and\nguidance, as well as the procedure for the discussions regarding\ndiscontinuing students’ studies, and will be responsible for\ninforming the students and the Dean of Undergraduate Studies\nof these decisions."
  },
  "doc-27582316f6338783150ff01bf47d2a59": {
    "content": "studies, and will be responsible for\ninforming the students and the Dean of Undergraduate Studies\nof these decisions. A student whose studies have been\nterminated will be entitled to appeal the decision in writing or\norally to the Dean of Undergraduate Studies. D. Students who were in poor academic standing when their\nstudies were terminated or when they discontinued their studies\non their own accord will be able to apply to return to their study\nprogram after two years from the date that their studies were\ndiscontinued (see Regulation 3.1.6)."
  },
  "doc-5d62261c0161f6d7dfd54a1f166d10b9": {
    "content": "to their study\nprogram after two years from the date that their studies were\ndiscontinued (see Regulation 3.1.6). 3.1.6 Admission for students with a prior academic\nbackground, and returning to studies after a break\nStudents in good academic standing who discontinue their\nstudies on their own accord will be able to apply to return to\ntheir studies at any time. If they have already completed one or\ntwo semesters, they will be able to choose between an\nadmission procedure that is based upon an agreement or an\nadmission procedure that is based on the unit’s\nrecommendation and the approval of the Dean of\nUndergraduate Studies."
  },
  "doc-ffa5f9e0cd29c6b1ee8d40042c9e9ab5": {
    "content": "admission procedure that is based on the unit’s\nrecommendation and the approval of the Dean of\nUndergraduate Studies. If students have completed at least three\nsemesters, they will be admitted to the Technion on the basis of\nthe unit’s recommendation and with the approval of the Dean\nof Undergraduate Studies. The unit will recommend to the\nstudent a course schedule to follow to complete his/her degree\nand may add specific requirements such as repeating courses in\nwhich the grade earned was less than 65, the extent of prior\ncourses that need to be completed, and the duration of studies."
  },
  "doc-96fc583997f1d652a9aa4945bb2b3e1c": {
    "content": "the grade earned was less than 65, the extent of prior\ncourses that need to be completed, and the duration of studies. === Page 11 ===\nUndergraduate Studies | 2021-2022\nStudents who return to their studies after a prolonged break\n(over 3 years) will have a plan determined for them regarding\ncourses that need to be completed in the scope of 10-25 credits. The unit’s recommendation will be sent to the Dean of\nUndergraduate Studies for approval, who will be in charge of\nmaking the final decision."
  },
  "doc-1d047c254e2b3777002550e17d5484fd": {
    "content": "will be sent to the Dean of\nUndergraduate Studies for approval, who will be in charge of\nmaking the final decision. Students who were in poor academic standing when their\nstudies were terminated or when they discontinued their studies\non their own accord at the Technion or any other institution,\nwill be able to apply to return to their study program two years\nfrom the date at which their studies were discontinued. Students\nwho discontinued their studies on their own accord after only\none semester will be able to request a shorter break period,\nhowever, this is subject to the approval of the academic unit."
  },
  "doc-b991fac920a5b868eeb06202152bc57c": {
    "content": "semester will be able to request a shorter break period,\nhowever, this is subject to the approval of the academic unit. Admission for students whose studies have been terminated or\nwho discontinued their studies on their own accord after\ncompleting only one semester will be based on the standard\nadmission requirements of the unit to which the student wants\nto be accepted. Requests to return to one’s studies among\nstudents who have completed at least two semesters require the\napproval of the Dean of Undergraduate Studies in addition to\nmeeting the admission requirements."
  },
  "doc-644f23d3f7f390648ed279a6a9bfa1fa": {
    "content": "semesters require the\napproval of the Dean of Undergraduate Studies in addition to\nmeeting the admission requirements. Requests to return to one’s\nstudies for students who have completed three or more\nsemesters will be discussed by the academic unit to which the\nstudent wants to be accepted. The academic unit may require\nthat the student take courses in an external setting during the\nyears in which they are on a break from their studies at the\nTechnion, and may specify an agreement stating that\ncompletion of these courses will serve as additional condition\nfor admission."
  },
  "doc-efa151e056e1b7e728f430c1003b29fa": {
    "content": "and may specify an agreement stating that\ncompletion of these courses will serve as additional condition\nfor admission. The academic unit will determine the required\ncurriculum for the degree, and may add specific requirements\nsuch as a requirement to repeat courses in which the grade\nearned was less than 65, the extent of prior courses that need to\nbe completed, and the duration of studies. Students who return\nto their studies after a prolonged break (over 3 years) will have\na plan determined for them regarding courses that need to be\ncompleted in the scope of 10-25 credits."
  },
  "doc-5a5ee85b364785bbde4b848acb77e31a": {
    "content": "years) will have\na plan determined for them regarding courses that need to be\ncompleted in the scope of 10-25 credits. The unit’s\nrecommendation will be sent to the Dean of Undergraduate\nStudies for approval, who will be in charge of making the final\ndecision. 3.1.7 Transferring admission tracks\nStudents will be able to transfer from one admission track to\nanother, in accordance with the following guidelines: Up until\nthe end of the second semester of their studies at the Technion,\nstudents will be able to transfer if their admission data meet the\nadmission threshold set by the unit."
  },
  "doc-ef9a332ae87a028683fd584b8a057e1a": {
    "content": "the Technion,\nstudents will be able to transfer if their admission data meet the\nadmission threshold set by the unit. The transfer will be\nconditional on their academic standing after they have fulfilled\nthe requirements of the semester in which the application is\nsubmitted (a GPA of at least 65, a course success rate of at least\n66%). Students who have completed at least two semesters at the\nTechnion and have taken courses from the standard course\nbasket (as approved by the Senate on May 23, 1993) and whose\nperformance ranks at the top 25% of the corresponding group\nof students within the study track to which they wish to transfer,\nwill be admitted to their desired study track."
  },
  "doc-39a0efc1fda66a771ae28d14a647394e": {
    "content": "regarding their admission on the basis\nof their academic performance at the Technion and their initial\nadmission data. 3.2 Bachelor’s Degree Completion\n3.2.1 Degree eligibility\nStudents who have completed an approved degree program\nwith a GPA of 65 or above are eligible to receive their degree. 3.2.2\tAdditional degree and a post-graduate program\nA. Additional degree\nStudents who are studying at the Technion and who wish to\npursue an additional bachelor’s degree will be able to apply for\nenrollment in the integrated study track in the additional unit in\nwhich they wish to study."
  },
  "doc-f3cd1c703725c64897f322242270f6a1": {
    "content": "will be able to apply for\nenrollment in the integrated study track in the additional unit in\nwhich they wish to study. Their application will be considered\nonly after they have accumulated at least 72 credits. The second unit in which the student wishes to study must\nsubmit their recommendation to the Dean of Undergraduate\nStudies for approval, on the basis of the student’s academic\nperformance, and the unit will determine the curriculum that the\nstudent will need to complete which will include all mandatory\ncontent for the additional track, with the exception of courses\nthat the student has already completed or will complete in the\ntrack of his/her “home” faculty."
  },
  "doc-cf016442577db9f9d57546e8e4c47cf5": {
    "content": "exception of courses\nthat the student has already completed or will complete in the\ntrack of his/her “home” faculty. The minimum credit points that\nthe student must accumulate in both tracks will be 0.75 of the\ntotal points that must be accumulated in each track. For example, if a student is studying in a track at the Technion\nin which 160 points must be accumulated, and wants to study\nfor another degree in a track in which 120 points must be\naccumulated, then in total, he/she must accumulate at least 210\npoints, and therefore, the remaining credits that the student must\ncomplete will consist of at least 50 points."
  },
  "doc-6f1696369af25dbccd7e3b5e90dc405d": {
    "content": "210\npoints, and therefore, the remaining credits that the student must\ncomplete will consist of at least 50 points. The program of study in the secondary track will be approved\nby the Dean of Undergraduate Studies. Students who complete\nthe requirements of the track will be awarded the additional\ndegree if their GPA in the secondary program is 65 or above,\nand only after they complete their studies in their home faculty. B."
  },
  "doc-ee85cf65ef649e8ee6257e54ac887783": {
    "content": "their GPA in the secondary program is 65 or above,\nand only after they complete their studies in their home faculty. B. Post-graduate program\nTechnion students and graduates of the Technion or other\nrecognized academic institutions can learn an additional field\nof study in addition to that in which they earned their first\n\n=== Page 12 ===\nUndergraduate Studies | 2021-2022\ndegree through the framework of the “Post-Graduate Program.”\nStudents will receive an additional certificate, that will\nconstitute an addition to the original diploma."
  },
  "doc-e7868b924d075ffac8d41a859724ee1f": {
    "content": "Program.”\nStudents will receive an additional certificate, that will\nconstitute an addition to the original diploma. This diploma is\nnot a separate degree but rather a “postgraduate” certificate. The scope of studies in the “Post-Graduate Program” after a 3-\nyear degree includes at least 45 credits. The scope of studies in\nthe “Post-Graduate Program” after a 4-year degree includes at\nleast 56 credits. In the Faculty of Education for Science and\nTechnion, it is possible to earn a certificate within the context\nof the “Post-Graduate Program” by completing 36 credits."
  },
  "doc-1997722c185d9585f286676b3c0557e4": {
    "content": "it is possible to earn a certificate within the context\nof the “Post-Graduate Program” by completing 36 credits. 3.2.3\tMinimum Technion credits\nThis regulation applies to students who studied at another\nacademic institution but did not complete their undergraduate\nstudies at that institution. Students who have received credits\nfor their previous studies at any academic institution will be\nrequired to complete at least 40 credits at the Technion in order\nto receive a bachelor’s degree from the Technion."
  },
  "doc-073628e65948de9ba16b9c57655e42ab": {
    "content": "be\nrequired to complete at least 40 credits at the Technion in order\nto receive a bachelor’s degree from the Technion. The\ncurriculum will be determined by the unit to which the student\nwas admitted. 3.2.4\tLevels of academic distinction\nThe study tracks will be periodically divided by the Dean of\nUndergraduate Studies, in consultation with the heads of the\nacademic units, into groups which will be called “study routes”\nfor the purposes of this section. The list of study routes will be\npublished on the Undergraduate Studies website."
  },
  "doc-73a7656c831bb0f859eabf5cb53cc71e": {
    "content": "for the purposes of this section. The list of study routes will be\npublished on the Undergraduate Studies website. The Dean of Undergraduate Studies will determine and publish,\nprior to the graduation ceremony held each year, the numerical\nthresholds for the academic distinction of summa cum laude\nand cum laude for each study route for the year leading up to\nthe ceremony in the following year. The thresholds for the\nfollowing year will be determined on the basis of the academic\nperformance of graduates in that study route in the previous\nsemester."
  },
  "doc-849f850b2b714e17e128a3d3040db281": {
    "content": "will be determined on the basis of the academic\nperformance of graduates in that study route in the previous\nsemester. The thresholds will be set in such a way that, in each\nstudy route, approximately 3% of students will graduate summa\ncum laude and approximately 15% of students will graduate\ncum laude (including those who graduate summa cum laude). The determination of each graduate’s level of distinction will\nbe made upon confirmation of graduation. The criterion for distinction is the student’s GPA for the list of\ncourses for their degree, which must be 91 or above, provided\nthat this GPA is above the threshold set for the summa cum\nlaude distinction in his/her study route."
  },
  "doc-7bc7b4e497a98cdabf62c3a4dc7c2939": {
    "content": "or above, provided\nthat this GPA is above the threshold set for the summa cum\nlaude distinction in his/her study route. The criterion for honors\nis the student’s GPA for the list of courses for their degree,\nwhich must be 84 or above, provided that this GPA is above the\nthreshold set for the cum laude distinction in his/her study route\n(and the student is not eligible to receive a degree with summa\ncum laude). This is in effect from the 2007-2008 class year,\nJune 2008 graduation ceremony. 3.2.5 Graduation dates\nEach student’s date of graduation is determined on the basis of\nthe date on which the last grade was received, and will be set\nfor the first of the month following that date."
  },
  "doc-201654cb9780de76ebd9aa76d0707dd3": {
    "content": "basis of\nthe date on which the last grade was received, and will be set\nfor the first of the month following that date. Confirmation of\ngraduation will be provided by the Dean of Undergraduate\nStudies. 3.2.6 Diplomas\nUpon completion of all degree requirements, students will\nspecify all the courses that they took towards their degree and\nall courses that they took beyond the requirements. The diploma\nwill include all courses classified as degree courses and will\nappear in ascending order (by course number), as well as a list\nof all courses classified as being beyond the requirements."
  },
  "doc-ee541be13784424dcf16115250227d28": {
    "content": "in ascending order (by course number), as well as a list\nof all courses classified as being beyond the requirements. If a\nstudent has repeated a course, only the most recent time that the\ncourse was taken will appear on the diploma (any courses that\nwere not completed will not appear on the lists, but if the course\nwas taken previously and the student received a grade, that\ngrade is valid and will appear on the lists). Appendix A: Procedure for Submitting a\nCurriculum\nThis procedure refers to the preparation of curricula, which are\nsubmitted by the council of the academic units to the Standing\nCommittee for Undergraduate and Graduate Studies, via the\nCentral Committee."
  },
  "doc-f61adafe5791d29f8488c8b1a7877559": {
    "content": "of the academic units to the Standing\nCommittee for Undergraduate and Graduate Studies, via the\nCentral Committee. A curriculum proposal must include the\nfollowing components:\nA. Summary of study program requirements for the degree\n1. The total number of credits, between 155-165 (or between\n116-124 for a three-year degree). In units in which the\nbachelor’s degree requires additional content credits, the\nnumber of credits will be updated accordingly. 2. Mandatory course requirements and a list of mandatory\ncourses (including foundational courses, in accordance with the\nrequirements of the Senate)."
  },
  "doc-7249abdf038c993c7b14559313397a04": {
    "content": "and a list of mandatory\ncourses (including foundational courses, in accordance with the\nrequirements of the Senate). 3. Requirements for elective courses and a list of the elective\ncourses, and the extent of it, as determined by the unit."
  },
  "doc-50e59020b86b8afe70e7f0d3176192a7": {
    "content": "Requirements for elective courses and a list of the elective\ncourses, and the extent of it, as determined by the unit. The total\nelective course requirements, as per this clause, will not be less\nthan 30 credits for a four-year program (20 credits in programs\nthat award dual or combined degrees, which are not in a single-\nprogram format as defined by The Council for Higher\nEducation) and 20 credits for three-year programs (15 credits in\nprograms that award dual or combined degrees, which are not\nin a single-program format as defined by The Council for\nHigher Education); in addition, there must be a reasonable\nnumber of choices from which students can select the elective\ncourses."
  },
  "doc-bdcb18f010bdd5cd4684919a6db35dc8": {
    "content": "in addition, there must be a reasonable\nnumber of choices from which students can select the elective\ncourses. 4. Completion of requirements through enrollment in general\nelective courses, amounting to at least 12 credits (10 credits in\na three-year program), of which 6 credits are for mandatory\nenrichment courses. B. Recommended course of study/curriculum\n1. The unit must submit a recommended course of study for 8\nsemesters (6 semesters in a three-year program). === Page 13 ===\nUndergraduate Studies | 2021-2022\n2."
  },
  "doc-cec6ce579ced65fccf6d83354c424e81": {
    "content": "of study for 8\nsemesters (6 semesters in a three-year program). === Page 13 ===\nUndergraduate Studies | 2021-2022\n2. The recommended curriculum will apply to students who\nbegin their studies in the winter semester or spring semester\nfollowing the approved curriculum. 3. The curriculum must meet the following criteria:\n Completion of fundamental courses within the first 5\nsemesters.  The curriculum must comply with the prerequisites and\ncorresponding requirements, as specified in the syllabus."
  },
  "doc-aa3681864c3c001ba9be1425885a8932": {
    "content": " The curriculum must comply with the prerequisites and\ncorresponding requirements, as specified in the syllabus.  The number of credits per semester will be between 18-22\n(18-20 in the first semester), and attention should be paid for\nensuring that the number of contact hours is reasonable; 30\ncontact hours is typically the maximum.  The number of final exams per semester in the\nrecommended curriculum should not exceed 7.  The “Advanced Technical English B” course was included\nin one of the first three semesters."
  },
  "doc-411d4c9a09ccf8a92906e1ceae1aee76": {
    "content": "should not exceed 7.  The “Advanced Technical English B” course was included\nin one of the first three semesters. C. Syllabi for new courses or changes to a syllabus\nD. Additional guidelines\n1. The curriculum and prerequisites should allow a competent\nstudent to complete their studies within 7 semesters, without\nenrolling in a summer semester; the recommended curriculum\nshould be examined through the perspective of the student. 2. Making changes to foundational courses will be possible\nonce every 3 years, with the exception of turning a mandatory\ncourse into an elective course."
  },
  "doc-bc4e3801e62a615c04904e85547dca24": {
    "content": "courses will be possible\nonce every 3 years, with the exception of turning a mandatory\ncourse into an elective course. E. Disclaimer\nAn explicit statement that the curriculum meets the credit\naccrual guidelines, as well as the requirements and criteria\nincluded in detail below. If there are any deviations, the\nstatement must indicate this explicitly and the matter will be\nbrought up for discussion within the Standing Committee for\nUndergraduate and Graduate Studies. Appendix B: Procedure for Establishing Tracks and\nNew Specializations\nDefinitions:\n Track – a program of study that leads to a separate degree."
  },
  "doc-4c12b891f1636b7232d52a40dd9a8d88": {
    "content": "Establishing Tracks and\nNew Specializations\nDefinitions:\n Track – a program of study that leads to a separate degree.  Specialization – a program of study with a particular\nconcentration for which the student’s participation is\nrecorded only on the transcript. When an academic unit, with the approval of its council,\nproposes to establish a new track that leads to a separate degree,\na proposal for approval shall be submitted to the Standing\nCommittee through the Academic Development Committee."
  },
  "doc-cd68a78ccbc50e4b765bd17123a29cde": {
    "content": "a proposal for approval shall be submitted to the Standing\nCommittee through the Academic Development Committee. When an academic unit decides, through its council, to establish\na new specialization within the framework of the study\nprogram, it shall be sent to the Standing Committee for\napproval. Approval for new courses within the same\nspecialization shall be carried out in accordance with the\nexisting procedure for approving courses. Appendix C: Decisions of the Kogan Committee for\nFoundational Studies\n1."
  },
  "doc-5755f50697948c6cc8af44839cb81e35": {
    "content": "the\nexisting procedure for approving courses. Appendix C: Decisions of the Kogan Committee for\nFoundational Studies\n1. Foundational courses will be offered to all academic units at\nthe Technion. There will no course adjustments for academic\nunits due to special arrangements. The topics in the\nfoundational courses will be determined by the units\nresponsible for them (mathematics, physics, chemistry,\nbiology, English, and computer science) in collaboration with\ncommittees that will be determined by the Senior Vice\nPresident for each of the units."
  },
  "doc-e5f8b4dbb9b12d31fd2e17142eca8589": {
    "content": "science) in collaboration with\ncommittees that will be determined by the Senior Vice\nPresident for each of the units. These committees will condense\nthe needs brought up by the units receiving the services, thus\nassisting in the construction of the foundational courses. 2. The Faculty of Architecture and Town Planning, the Faculty\nof Medicine, the Faculty of Biology, and the area of Economics\nand Management in the Faculty of Industrial Engineering and\nManagement will be exceptions. Committees shall be\nestablished that will discuss the framework for foundational\ncourses in their units."
  },
  "doc-62eb72499c6965c02ef18379c794a4d8": {
    "content": "be exceptions. Committees shall be\nestablished that will discuss the framework for foundational\ncourses in their units. 3. There will be a requirement to complete 40 credits of\nfoundational courses. These credits will be divided as follows:\n15 credits in mathematics courses,\n12 credits in the natural sciences (Physics, Chemistry, and\nBiology),\n4 credits in Introduction to Computers,\n3 credits for Technical English,\n6 credits to be selected from Mathematics courses and Natural\nSciences courses. 4."
  },
  "doc-12c3df578bf20433594e4458c47c05e0": {
    "content": "3 credits for Technical English,\n6 credits to be selected from Mathematics courses and Natural\nSciences courses. 4. In the Science units (Mathematics, Physics, Chemistry, and\nBiology), it will be mandatory to take courses that total a\nminimum of 6 credits from the basket of courses in the Natural\nSciences, which are not offered by the unit itself. 5. The choice of courses from the Mathematics and Natural\nSciences baskets will be made by each unit, in accordance with\nits needs. For example, a unit can choose some of the courses\nfrom the baskets of natural sciences and physics, and some of\nthe courses from chemistry or biology."
  },
  "doc-dea93b1ec74705baaa6bca83e5f6e934": {
    "content": "of the courses\nfrom the baskets of natural sciences and physics, and some of\nthe courses from chemistry or biology. 6. Within the framework of general studies, special divisions\nwill be organized and each of them will include a number of\nrelevant courses. === Page 14 ===\nUndergraduate Studies | 2021-2022\nAppendix D: Exam Procedures and the Provision of\nGrades\n1. Purpose\nThe purpose of this procedure is to establish rules for exams and\nthe provision of grades, as is customary at the Technion. 2."
  },
  "doc-8aad4f626cbd684c9b53a1595613bce0": {
    "content": "of this procedure is to establish rules for exams and\nthe provision of grades, as is customary at the Technion. 2. Instructor responsible for the course; standardized\nassessment\nFor each course that is offered by more than one instructor, the\nhead of the unit offering the course will appoint an instructor\nwho will be responsible for that particular course. In addition to\nthe instructor’s role of being responsible for the course, this\ninstructor will also be responsible for the exam, grades, and\ngrade appeals in the course; will ensure that the exam is uniform\nacross all instructors; and will ensure that the assessment\nmethod is identical for all students enrolled in the course."
  },
  "doc-828ef7020b4ce94d748a071420a7ea98": {
    "content": "all instructors; and will ensure that the assessment\nmethod is identical for all students enrolled in the course. The\nDean of Undergraduate Studies may approve exceptions to\nthese instructions. The instructor in charge will be the one who\nwill approve the grades given by the instructors who teach the\ncourse and the graders of the exam. 3. Method of teaching for the course; exams; grade\ncomponents\nAt the start of the course, teachers must specify the teaching\nobjectives and requirements to the students of the course,\nincluding attendance requirements, exams, assignments,\nquizzes, tours, etc., as well as the implications arising from\npartial fulfillment of course requirements."
  },
  "doc-e27f916438d948e6f53612bcee3350a4": {
    "content": "assignments,\nquizzes, tours, etc., as well as the implications arising from\npartial fulfillment of course requirements. The details of the\nmaterial that will be taught in the course will be included on the\ncourse syllabus, as determined by the course instructor, in\naddition to the material that will be taught in class. At the start\nof the course, and at the latest within the first two weeks of the\nsemester, the instructor will determine the components of the\nfinal grade, the weight of each component and how each\ncomponent will be weighed, and will inform the students of this\nin writing or on the course website."
  },
  "doc-2758c78432225436040a953c86455041": {
    "content": "and how each\ncomponent will be weighed, and will inform the students of this\nin writing or on the course website. If exams will be held in the\ncourse, the instructor must inform the students in advance what\ntype of exams will be included. The instructor of the course\ncannot change the components of the final grade during the\nsemester, except in exceptional circumstances and with the\napproval of the head of the academic unit. The instructor\nappointed to be responsible for the course will also be\nresponsible for all that is stated in this section (see point 2\nabove)."
  },
  "doc-2e260abcde861227fddd9e7e087466b2": {
    "content": "to be responsible for the course will also be\nresponsible for all that is stated in this section (see point 2\nabove). Exams are typically held at the end of each semester. Students\nwho have fulfilled the academic requirements of the course and\npaid tuition, in accordance with their obligation and subject to\ntuition regulations, will be permitted to take the exam. Final\nexams include a first date of exam (Moed A) and a second date\nof exam (Moed B). Tests given during the course of the\nsemester typically only have one date on which students can\ntake the test."
  },
  "doc-8ccba3bd5ee81c841dda6a16de3e1c4a": {
    "content": "B). Tests given during the course of the\nsemester typically only have one date on which students can\ntake the test. 4. Exam arrangements; performance evaluations;\nmultiple-choice exams\n4.1 The purpose of the exam is to evaluate students’\nunderstanding of the course material. 4.2 In accordance with the schedule, as determined by the\nUndergraduate Studies Secretariat, the instructor\nresponsible for the course will prepare the exam."
  },
  "doc-b9566dfd8eca81d48d4aa233b23af66e": {
    "content": "determined by the\nUndergraduate Studies Secretariat, the instructor\nresponsible for the course will prepare the exam. It is\nadvisable for the instructor in charge of the course to\nconsult with the other instructors, who are also proficient\nin the course material, to ensure that the exam addresses\nthe material specified in the syllabus, that there are no\nerrors in the questions and that they are clearly worded, that\nthe duration of the exam is reasonable and that the exam\ncontent matches with the course content."
  },
  "doc-c4e711afdbe13ce9b3f01edfc1bb5244": {
    "content": "clearly worded, that\nthe duration of the exam is reasonable and that the exam\ncontent matches with the course content. The instructor\nwill be in charge of getting the exam printed and copied, as\nwell as for holding onto it and bringing it to the exam\nlocation. If necessary, the instructor will be able to enlist\nthe services of the Undergraduate Studies Secretariat to\nmake copies of the exam while ensuring its confidentiality. 4.3 The relative weight of each question should be specified in\nthe exam questionnaire."
  },
  "doc-12bedc7d54fa34456c8c5e6b19367c42": {
    "content": "ensuring its confidentiality. 4.3 The relative weight of each question should be specified in\nthe exam questionnaire. It is also recommended that the\nrelative weight of each component of the question, if\napplicable, be specified in the exam questionnaire. 4.4 Any exams that include multiple-choice questions\n(“American” style questions) should have at least three\nexam versions. In other words, there must be at least three\nexam forms that will have the questions and/or answer\nchoices appear in different orders."
  },
  "doc-d229eb8a5dd395994a52a9e45818bf4a": {
    "content": "there must be at least three\nexam forms that will have the questions and/or answer\nchoices appear in different orders. 4.5 For oral exams, it is recommended that they be conducted\nin the presence of at least two examiners/graders. 5. Exam dates; exam rooms; exam duration\n5.1 The exam schedule will be determined and published for\nthe students to see prior to the course registration period. After the exam schedule is published, it is strictly forbidden\nto make changes/cancellations/additions. If a need arises to\nmake changes/cancellations/additions due to justifiable\nreasons, a written process will take place (as opposed to a\nverbal one) such that the faculty teaching the course will\nsubmit an organized request to the Dean of Undergraduate\nStudies."
  },
  "doc-1ede3569d5b36da336d3abbced697c59": {
    "content": "one) such that the faculty teaching the course will\nsubmit an organized request to the Dean of Undergraduate\nStudies. The instructor will commit to solving any\nproblems that arise as a result of the change. The request\nwill be approved if the following conditions are met:\n1. All students provide their consent in writing. 2. The change is acceptable to the instructor. 3. There are available rooms to hold the exam. 4. The faculty making the request will take care of\nannouncing the change. 5.2 The exam schedule and exam rooms will be determined by\nthe Secretary of Undergraduate Studies, after receiving, in\n\n=== Page 15 ===\nUndergraduate Studies | 2021-2022\nadvance, the list of exams, including exam durations, dates,\nand other requirements, from the unit."
  },
  "doc-d8a47427dfbb5343b6afaa1ff0545e0d": {
    "content": "Studies | 2021-2022\nadvance, the list of exams, including exam durations, dates,\nand other requirements, from the unit. 5.3 As a general rule, the time allotted for the exam may not\nexceed three hours in total. Any deviation from this rule\nrequires the approval of the unit’s undergraduate division\nand the Dean of Undergraduate Studies. 6. Identification of examinees; instructions for examinees;\ninstructions for exam supervisors; exam supervision\n6.1 Examinees must arrive to the exam room at least 10\nminutes prior to the start of the exam with their student ID\nor their ID card."
  },
  "doc-0129553be2e2f3c190bed839e99f9546": {
    "content": "must arrive to the exam room at least 10\nminutes prior to the start of the exam with their student ID\nor their ID card. Students who do not have an ID card can\nonly take the exam after the course instructor identifies\nthem, or if an appropriate arrangement has been made\nbetween the student and the instructor. 6.2 Students must be seated in specified room that they were\nassigned to take the exam, and not in a room of their\nchoosing. If a list of seating arrangements has been\nprepared, students must sit only in the seat designated for\nthem and not in another seat of their choosing."
  },
  "doc-6ef879639466fdfe9eba15b23d55abe1": {
    "content": "has been\nprepared, students must sit only in the seat designated for\nthem and not in another seat of their choosing. 6.3 The Secretary of Undergraduate Studies shall notify the\nheads of the units regarding the number of supervisors that\nare required to be in each room. 6.4 Students will act in accordance with the instructions given\nby the exam supervisors while in the exam room. The exam\nsupervisor may, at his/her discretion, move a student to\nanother seat at any time. Upon entering the exam rooms,\nstudents will leave their belongings at the entrance\n(including electronic means of communication which must\nbe turned off)."
  },
  "doc-60847d9ea893bad775c656c490f0272c": {
    "content": "will leave their belongings at the entrance\n(including electronic means of communication which must\nbe turned off). They will only come into the exam room\nwith the material that is permitted for the exam, will sit in\nthe place designated for them by the supervisor and will\navoid having any conversations. During the entirety of the\nexam, it is forbidden to have within reach, in the exam\nroom, or next to the exam room any material that is related\nto the exam itself or the subject of the exam, except for\nmaterial that has been permitted by the instructor."
  },
  "doc-2f3695091ce73e2d9377bf474585bbcd": {
    "content": "related\nto the exam itself or the subject of the exam, except for\nmaterial that has been permitted by the instructor. If a\ncalculator is needed for the exam, only simple scientific\ncalculators that have no means of communication can be\nused. 6.5 A student who enters the exam room and receives the exam\nis considered to have participated in the exam. Students\nmay not leave the exam room during the first hour except\nfor going to the bathroom, as specified in Section 6.7\nbelow. Students will not be allowed to enter the exam room\nafter 30 minutes or more have passed during the start of the\nexam."
  },
  "doc-87069f4f080b44d9b70443633d68b936": {
    "content": "Students will not be allowed to enter the exam room\nafter 30 minutes or more have passed during the start of the\nexam. 6.6 The course instructor, or someone appointed by him/her,\nmust be present at the start of the exam and be available\nthroughout the exam to answer students’ questions. In\ncases in which the exam is supervised by external\nsupervisors, the instructor must arrive to the exam room\nprior to the start of the exam to guide the supervisors. The\nrole of external supervisors is to oversee the exam only."
  },
  "doc-038614b9779f37fc357226b8db0ded24": {
    "content": "prior to the start of the exam to guide the supervisors. The\nrole of external supervisors is to oversee the exam only. Any deviation from the guidelines for supervisors is\nconditional on the approval of the Dean of Undergraduate\nStudies and with prior coordination. 6.7 For exams that last two or more hours, bathroom breaks\nwill be permitted during the middle third of the exam. Bathroom breaks will be conducted in an orderly manner\nby the supervisors. 6.8 In very exceptional circumstances, the instructor in charge,\nor someone on his/her behalf, may decide to provide extra\ntime on the exam for all students."
  },
  "doc-12f99e1de58b5f6f82ebb92b69317833": {
    "content": "the instructor in charge,\nor someone on his/her behalf, may decide to provide extra\ntime on the exam for all students. Extra time for certain\nstudents will be given on the basis of approval from the\nDean of Undergraduate Studies only; the instructor must\nrespect this approval. The student must bring with him/her\nthe time extension approval and present it to the\nsupervisors at the exam. All students eligible for time\nextensions will sit in a separate room (if possible) that will\nbe devoted for time extensions."
  },
  "doc-df961a7eba3c757658509ba55a8d7962": {
    "content": "eligible for time\nextensions will sit in a separate room (if possible) that will\nbe devoted for time extensions. 6.9 If additional supervisors are needed (in addition to the\nexternal supervisors and the course instructors and their\nassistants), the head of the unit will utilize the list of\nassistants and instructors in the unit and divide the\nsupervision load among them. Adjunct instructors will only\nsupervise exams that they teach. The remainder of the\ninstructors in the unit and all the assistants and facilitators\nwill supervise the exams in the unit, in accordance with the\ninstructions of the head of the unit."
  },
  "doc-2d09aa69f87cbe11e96779061fd2f460": {
    "content": "and facilitators\nwill supervise the exams in the unit, in accordance with the\ninstructions of the head of the unit. For exams in which\nthere are no external supervisors, the supervisors will\nreceive a copy of the “Instructions for Exam Supervisors”\ndocument from the Undergraduate Studies Secretariat and\nwill fulfill their role accordingly. Any unusual event during\nthe exam will be reported on the supervision form. 7. Grading exams; publishing grades\n7.1 The instructor in charge of the course is responsible for the\ngrading of the exams."
  },
  "doc-aa73ecc84819b722b1293c29a3af5f6a": {
    "content": "exams; publishing grades\n7.1 The instructor in charge of the course is responsible for the\ngrading of the exams. Written exams and tests conducted\nat the exam dates stipulated in Section 2.2.3 of the\nUndergraduate Studies Regulations and Procedures will be\ngraded without seeing the name of the examinee on the\nexam notebook. The instructor in charge of the course can\nbe assisted by assistant instructors, but the final grade must\nbe provided by him/her only. If there is no option to do so\nlogistically, then it will be done by another senior\ninstructor, as determined by the head of the unit."
  },
  "doc-047145da85278c9c15c28caacd056b67": {
    "content": "option to do so\nlogistically, then it will be done by another senior\ninstructor, as determined by the head of the unit. It is\nrecommended that teaching assistants and undergraduate\nstudents who grade practicums do not grade final exams. 7.2 The instructor in charge of the course will be personally\nresponsible for submitting the list of students’ scores in the\ncourse to the unit’s Undergraduate Studies Secretary. The\ngrades will be sent from the instructor to the head of the\nacademic unit responsible for teaching the course, and if\n\n=== Page 16 ===\nUndergraduate Studies | 2021-2022\nhe/she has no reservations, the grades will be sent for\npublication."
  },
  "doc-02b48ed2714c8aa96a0b35a877e34c81": {
    "content": "=== Page 16 ===\nUndergraduate Studies | 2021-2022\nhe/she has no reservations, the grades will be sent for\npublication. The course instructor is responsible for\npublishing course grades within 10 days from the date of\nthe exam. 7.3 Students may take the exam on the first date that it is\noffered (Moed A) and/or the second date that it is offered\n(Moed B). It is recommended that students take the exam\non the first date. Students are not allowed to take three\nexams for the same course in the same semester."
  },
  "doc-04e34fd698deb65f3f4000affcbc4d6b": {
    "content": "take the exam\non the first date. Students are not allowed to take three\nexams for the same course in the same semester. In all\ncases in which a student takes more than one exam in a\ngiven course, the last grade that they received will be the\nfinal grade. 7.4 Students may receive a photocopied or scanned copy of\ntheir exam notebook within a reasonable amount of time\nfollowing the publication of grades. 8. Grade appeals\n8.1 Students may file an appeal within 4 days of when a copy\nof their exam notebook becomes available."
  },
  "doc-659e73b58c8c81197fcc7411cbfa46d8": {
    "content": "8. Grade appeals\n8.1 Students may file an appeal within 4 days of when a copy\nof their exam notebook becomes available. 8.2 The appeal must be submitted in writing on a form that can\nbe obtained from the unit. The student must specify his/her\nreasons for filing the appeal on the form. The student filing\nInternational Program Students at the\nthe appeal will be made aware that the entire exam may be\nre-graded, and not just the sections that he/she specified in\nthe appeal. Thus, the appeal may result in no change to the\ngrade, a higher score or a lower score."
  },
  "doc-e3a0882cc0af74211eb10d5265c89490": {
    "content": "he/she specified in\nthe appeal. Thus, the appeal may result in no change to the\ngrade, a higher score or a lower score. There is no right to\nappeal a grade on an oral exam. 8.3 The course instructor must respond to appeals within a\nreasonable amount of time (no later than one week before\nthe second exam date). An instructor who wishes to change\na grade, must submit a reasoned request to be approved by\nthe Dean of Undergraduate Studies. Any grade change\nrequests submitted to the Undergraduate Studies Secretary\nlong after the publication of the grade, must be reasoned\nand detailed and must receive approval from the\nundergraduate studies division in the unit."
  },
  "doc-36f136a56655832a9c06d0aa266c3b1d": {
    "content": "the grade, must be reasoned\nand detailed and must receive approval from the\nundergraduate studies division in the unit. These types of\nrequests will be brought for approval by the Dean of\nUndergraduate Studies. 9. Holding on to exam notebooks\nAfter the exams, exam notebooks are to be kept by the\ninstructor for one year. After this period of time, the\nnotebooks can be destroyed. Graduation Ceremony\n\n=== Page 17 ===\nUndergraduate Studies | 2021-2022\nSpecializations at the Technion\nSecondary Specialization in Entrepreneurial\nLeadership\nA new program designed for students across all faculties at the\nTechnion."
  },
  "doc-c97321d2a4627e724f88dcae82260f88": {
    "content": "Specialization in Entrepreneurial\nLeadership\nA new program designed for students across all faculties at the\nTechnion. The secondary specialization in entrepreneurial leadership will\nconsist of three academic layers (worth a total of 10 credits):\n1. Faculty courses on entrepreneurship in the field of\nknowledge of the faculty – mandatory (2 credits). 2. Entrepreneurial leadership course in the Department\nof Humanities in collaboration with the Center for\nEntrepreneurship and Innovation at the Technion –\nmandatory (2 credits)."
  },
  "doc-c7bda2cc8ad8b9271b9d5e97e56b1ea2": {
    "content": "in collaboration with the Center for\nEntrepreneurship and Innovation at the Technion –\nmandatory (2 credits). 3. Cluster of elective courses (6 credits, choice of 3\ncourses from a total of 10 courses that are offered) in\nthe Department of Humanities in collaboration with\nthe Center for Entrepreneurship and Innovation at the\nTechnion. The specialization is intended for undergraduate students of\nthe Technion. As part of the specialization, students will take\ncourses on a variety of topics covering the theory, practical\nexperience, and application of ‘entrepreneurial leadership’."
  },
  "doc-4978df59d7f05a47dd1a55731bbe92ca": {
    "content": "on a variety of topics covering the theory, practical\nexperience, and application of ‘entrepreneurial leadership’. Admission Requirements\nUndergraduate students at the Technion who meet the\nfollowing conditions will be able to apply:\n1. Successfully completed courses totaling at least 36\ncredits. 2. Cumulative GPA above 75. Each student’s application must be submitted to the\nUndergraduate Studies Secretariat of the faculty. Eligibility for the Specialization Certificate\nAs part of the specialization, students must complete at least\n10 credits, 5 of which will be from the framework of the\nstudent’s degree and the rest will be considered to be beyond\nthe degree requirements."
  },
  "doc-db0df7c02ef1b7fee0ce171d77b90c21": {
    "content": "be from the framework of the\nstudent’s degree and the rest will be considered to be beyond\nthe degree requirements. In order to receive a specialization\ncertificate, the following requirements must be met:\nA. Completing the degree requirements of the primary\ndegree program in which the student is enrolled. B. Completion of the mandatory courses:\n1. Entrepreneurial Leadership – 2 credits\n2. Technological/Scientific Leadership in the faculty\nwithin the field of knowledge required – 2 credits\nC. At least 3 elective courses from the ‘Entrepreneurial\nLeadership’ basket of courses."
  },
  "doc-ad3f3772e6b57b3dc77d48856bf48f5e": {
    "content": "knowledge required – 2 credits\nC. At least 3 elective courses from the ‘Entrepreneurial\nLeadership’ basket of courses. These courses are recognized\nas courses of The Council for Higher Education:\n1. Fundamentals of Entrepreneurship – 2 credits\n2. Management of Entrepreneurial Projects – 2 credits\n3. Leadership and Social Entrepreneurship – 2 credits\n4. Business Entrepreneurship – 2 credits\n5. Harnessing the Business Ecosystem – 2 credits\n6. Entrepreneurial Leadership in Organizations –\nDevelopments and Trends – 2 credits\n7."
  },
  "doc-7aaa971c8c9bccf4041567aaa47ea49f": {
    "content": "Business Ecosystem – 2 credits\n6. Entrepreneurial Leadership in Organizations –\nDevelopments and Trends – 2 credits\n7. Legal Aspects of Business Entrepreneurship – 2\ncredits\n8. Marketing for Entrepreneurs – 2 credits\n9. High-Tech in Israel – A Strategy for Preserving\nGlobal Leadership – 2 credits\n10. Usability of Software Interfaces – 2 credits\n11. Design Thinking – 2 credits\n12. Creativity, Innovation and Happiness – 2 credits"
  }
}